Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_eth equates.
 */
#pragma once

#include    <stdint.h>

// ETH address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    MACCR;
    volatile    uint32_t    MACECR;
    volatile    uint32_t    MACPFR;
    volatile    uint32_t    MACWJBTR;
    volatile    uint32_t    MACHT0R;
    volatile    uint32_t    MACHT1R;
    volatile    uint32_t    RESERVED0[14];
    volatile    uint32_t    MACVTCR;
    volatile    uint32_t    MACVTDR;
    volatile    uint32_t    MACVHTR;
    volatile    uint32_t    RESERVED1;
        union {
    volatile    uint32_t    MACVIR;
    volatile    uint32_t    MACVIR_ALTERNATE1;
        };
    volatile    uint32_t    MACIVIR;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    MACQ0TXFCR;
    volatile    uint32_t    RESERVED3[7];
    volatile    uint32_t    MACRXFCR;
    volatile    uint32_t    MACRXQCR;
    volatile    uint32_t    RESERVED4[2];
    volatile    uint32_t    MACRXQC0R;
    volatile    uint32_t    MACRXQC1R;
    volatile    uint32_t    MACRXQC2R;
    volatile    uint32_t    RESERVED5;
    volatile    uint32_t    MACISR;
    volatile    uint32_t    MACIER;
    volatile    uint32_t    MACRXTXSR;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    MACPCSR;
    volatile    uint32_t    MACRWKPFR;
    volatile    uint32_t    RESERVED7[2];
    volatile    uint32_t    MACLCSR;
    volatile    uint32_t    MACLTCR;
    volatile    uint32_t    MACLETR;
    volatile    uint32_t    MAC1USTCR;
    volatile    uint32_t    RESERVED8[6];
    volatile    uint32_t    MACPHYCSR;
    volatile    uint32_t    RESERVED9[5];
    volatile    uint32_t    MACVR;
    volatile    uint32_t    MACDR;
    volatile    uint32_t    RESERVED10;
    volatile    uint32_t    MACHWF0R;
    volatile    uint32_t    MACHWF1R;
    volatile    uint32_t    MACHWF2R;
    volatile    uint32_t    MACHWF3R;
    volatile    uint32_t    RESERVED11[53];
    volatile    uint32_t    MACMDIOAR;
        union {
    volatile    uint32_t    MACMDIODR;
    volatile    uint32_t    B10T1S_PLCA_CR;
    volatile    uint32_t    B10T1S_PLCA_NODECR;
    volatile    uint32_t    B10BT1S_PLCA_TMR;
    volatile    uint32_t    B10T1S_PLCA_SR;
    volatile    uint32_t    B10T1S_PCS_CR;
    volatile    uint32_t    B10T1S_PCS_SR;
    volatile    uint32_t    B10T1S_PCS_DIAG1;
    volatile    uint32_t    B10T1S_PCS_DIAG2;
    volatile    uint32_t    B10T1S_PCS_JBTMR;
    volatile    uint32_t    B10T1S_PMA_EXTABLTY;
    volatile    uint32_t    B10T1S_PMA_PMD_CR;
    volatile    uint32_t    B10T1S_PMA_CR;
    volatile    uint32_t    B10T1S_PMA_SR;
    volatile    uint32_t    B10T1S_PMA_TMCR;
    volatile    uint32_t    B10T1S_PMA_DR;
    volatile    uint32_t    B10T1S_XCVR_PHYID_LSB;
    volatile    uint32_t    B10T1S_XCVR_PHYID_MSB;
    volatile    uint32_t    B10T1S_XCVR_MIIMCTRL;
        };
    volatile    uint32_t    RESERVED12[2];
    volatile    uint32_t    MACARPAR;
    volatile    uint32_t    RESERVED13[3];
    volatile    uint32_t    MAC10BT1SCR;
    volatile    uint32_t    RESERVED14[3];
    volatile    uint32_t    MACCSRSWCR;
    volatile    uint32_t    MACFPECSR;
    volatile    uint32_t    RESERVED15[2];
    volatile    uint32_t    MACPRSTIMR;
    volatile    uint32_t    MACPRSTIMUR;
    volatile    uint32_t    RESERVED16[46];
    volatile    uint32_t    MACA0HR;
    volatile    uint32_t    MACA0LR;
    volatile    uint32_t    MACA1HR;
    volatile    uint32_t    MACA1LR;
    volatile    uint32_t    MACA2HR;
    volatile    uint32_t    MACA2LR;
    volatile    uint32_t    MACA3HR;
    volatile    uint32_t    MACA3LR;
    volatile    uint32_t    RESERVED17[248];
    volatile    uint32_t    MMC_CONTROL;
    volatile    uint32_t    MMC_RX_INTERRUPT;
    volatile    uint32_t    MMC_TX_INTERRUPT;
    volatile    uint32_t    MMC_RX_INTERRUPT_MASK;
    volatile    uint32_t    MMC_TX_INTERRUPT_MASK;
    volatile    uint32_t    TX_OCTET_COUNT_GOOD_BAD;
    volatile    uint32_t    TX_PACKET_COUNT_GOOD_BAD;
    volatile    uint32_t    TX_BROADCAST_PACKETS_GOOD;
    volatile    uint32_t    TX_MULTICAST_PACKETS_GOOD;
    volatile    uint32_t    TX_64OCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    TX_64TO127OCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    TX_128TO255OCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    TX_256TO511OCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    TX_512TO1023OCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    TX_UNICAST_PACKETS_GOOD_BAD;
    volatile    uint32_t    TX_MULTICAST_PACKETS_GOOD_BAD;
    volatile    uint32_t    TX_BROADCAST_PACKETS_GOOD_BAD;
    volatile    uint32_t    TX_UNDERFLOW_ERROR_PACKETS;
    volatile    uint32_t    TX_SINGLE_COLLISION_GOOD_PACKETS;
    volatile    uint32_t    TX_MULTIPLE_COLLISION_GOOD_PACKETS;
    volatile    uint32_t    TX_DEFERRED_PACKETS;
    volatile    uint32_t    TX_LATE_COLLISION_PACKETS;
    volatile    uint32_t    TX_EXCESSIVE_COLLISION_PACKETS;
    volatile    uint32_t    TX_CARRIER_ERROR_PACKETS;
    volatile    uint32_t    TX_OCTET_COUNT_GOOD;
    volatile    uint32_t    TX_PACKET_COUNT_GOOD;
    volatile    uint32_t    TX_EXCESSIVE_DEFERRAL_ERROR;
    volatile    uint32_t    TX_PAUSE_PACKETS;
    volatile    uint32_t    TX_VLAN_PACKETS_GOOD;
    volatile    uint32_t    TX_OSIZE_PACKETS_GOOD;
    volatile    uint32_t    RESERVED18;
    volatile    uint32_t    RX_PACKETS_COUNT_GOOD_BAD;
    volatile    uint32_t    RX_OCTET_COUNT_GOOD_BAD;
    volatile    uint32_t    RX_OCTET_COUNT_GOOD;
    volatile    uint32_t    RX_BROADCAST_PACKETS_GOOD;
    volatile    uint32_t    RX_MULTICAST_PACKETS_GOOD;
    volatile    uint32_t    RX_CRC_ERROR_PACKETS;
    volatile    uint32_t    RX_ALIGNMENT_ERROR_PACKETS;
    volatile    uint32_t    RX_RUNT_ERROR_PACKETS;
    volatile    uint32_t    RX_JABBER_ERROR_PACKETS;
    volatile    uint32_t    RX_UNDERSIZE_PACKETS_GOOD;
    volatile    uint32_t    RX_OVERSIZE_PACKETS_GOOD;
    volatile    uint32_t    RX_64OCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    RX_65TO127OCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    RX_128TO255OCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    RX_256TO511OCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    RX_512TO1023OCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD;
    volatile    uint32_t    RX_UNICAST_PACKETS_GOOD;
    volatile    uint32_t    RX_LENGTH_ERROR_PACKETS;
    volatile    uint32_t    RX_OUT_OF_RANGE_PACKETS;
    volatile    uint32_t    RX_PAUSE_PACKETS;
    volatile    uint32_t    RX_FIFO_OVERFLOW_PACKETS;
    volatile    uint32_t    RX_VLAN_PACKETS_GOOD_BAD;
    volatile    uint32_t    RX_WATCHDOG_ERROR_PACKETS;
    volatile    uint32_t    RX_RECEIVE_ERROR;
    volatile    uint32_t    RX_CONTROL_PACKETS_GOOD;
    volatile    uint32_t    RESERVED19;
    volatile    uint32_t    TX_LPI_USEC_CNTR;
    volatile    uint32_t    TX_LPI_TRAN_CNTR;
    volatile    uint32_t    RX_LPI_USEC_CNTR;
    volatile    uint32_t    RX_LPI_TRAN_CNTR;
    volatile    uint32_t    RESERVED20[41];
    volatile    uint32_t    MMC_FPE_TX_ISR;
    volatile    uint32_t    MMC_FPE_TX_IMR;
    volatile    uint32_t    MMC_FPE_TX_FCR;
    volatile    uint32_t    MMC_TX_HRCR;
    volatile    uint32_t    RESERVED21[4];
    volatile    uint32_t    MMC_FPE_RX_ISR;
    volatile    uint32_t    MMC_FPE_RX_IMR;
    volatile    uint32_t    RX_PACKET_ASM_ERR;
    volatile    uint32_t    RX_PACKET_SMD_ERR;
    volatile    uint32_t    RX_PACKET_ASM_OKR;
    volatile    uint32_t    RX_FPE_FRAG_CR;
    volatile    uint32_t    RESERVED22[10];
    volatile    uint32_t    MACL3L4C0R;
    volatile    uint32_t    MACL4A0R;
    volatile    uint32_t    RESERVED23[2];
    volatile    uint32_t    MACL3A00R;
    volatile    uint32_t    MACL3A10R;
    volatile    uint32_t    MACL3A20R;
    volatile    uint32_t    MACL3A30R;
    volatile    uint32_t    RESERVED24[4];
    volatile    uint32_t    MACL3L4C1R;
    volatile    uint32_t    MACL4A1R;
    volatile    uint32_t    RESERVED25[2];
    volatile    uint32_t    MACL3A01R;
    volatile    uint32_t    MACL3A11R;
    volatile    uint32_t    MACL3A21R;
    volatile    uint32_t    MACL3A31R;
    volatile    uint32_t    RESERVED26[72];
    volatile    uint32_t    MAC_IACR;
    volatile    uint32_t    MAC_TMRQR;
    volatile    uint32_t    RESERVED27[34];
    volatile    uint32_t    MACTSCR;
    volatile    uint32_t    MACSSIR;
    volatile    uint32_t    MACSTSR;
    volatile    uint32_t    MACSTNR;
    volatile    uint32_t    MACSTSUR;
    volatile    uint32_t    MACSTNUR;
    volatile    uint32_t    MACTSAR;
    volatile    uint32_t    RESERVED28;
    volatile    uint32_t    MACTSSR;
    volatile    uint32_t    MACRXDTI;
    volatile    uint32_t    MACTXDTI;
    volatile    uint32_t    RESERVED29;
    volatile    uint32_t    MACTXTSSNR;
    volatile    uint32_t    MACTXTSSSR;
    volatile    uint32_t    RESERVED30[2];
    volatile    uint32_t    MACACR;
    volatile    uint32_t    RESERVED31;
    volatile    uint32_t    MACATSNR;
    volatile    uint32_t    MACATSSR;
    volatile    uint32_t    MACTSIACR;
    volatile    uint32_t    MACTSEACR;
    volatile    uint32_t    MACTSICNR;
    volatile    uint32_t    MACTSECNR;
    volatile    uint32_t    RESERVED32[2];
    volatile    uint32_t    MACTSILR;
    volatile    uint32_t    MACTSELR;
        union {
    volatile    uint32_t    MACPPSCR;
    volatile    uint32_t    MACPPSCR_ALTERNATE1;
        };
    volatile    uint32_t    RESERVED33[3];
    volatile    uint32_t    MACPPSTTS0R;
    volatile    uint32_t    MACPPSTTN0R;
    volatile    uint32_t    MACPPSI0R;
    volatile    uint32_t    MACPPSW0R;
    volatile    uint32_t    MACPPSTTS1R;
    volatile    uint32_t    MACPPSTTN1R;
    volatile    uint32_t    MACPPSI1R;
    volatile    uint32_t    MACPPSW1R;
    volatile    uint32_t    RESERVED34[8];
    volatile    uint32_t    MACPOCR;
    volatile    uint32_t    MACSPI0R;
    volatile    uint32_t    MACSPI1R;
    volatile    uint32_t    MACSPI2R;
    volatile    uint32_t    MACLMIR;
    volatile    uint32_t    RESERVED35[11];
    volatile    uint32_t    MTLOMR;
    volatile    uint32_t    RESERVED36[7];
    volatile    uint32_t    MTLISR;
    volatile    uint32_t    RESERVED37[3];
    volatile    uint32_t    MTLRXQDMAMR;
    volatile    uint32_t    RESERVED38[3];
    volatile    uint32_t    MTLTBSCR;
    volatile    uint32_t    RESERVED39[3];
    volatile    uint32_t    MTLESTCR;
    volatile    uint32_t    MTLESTECR;
    volatile    uint32_t    MTLESTSR;
    volatile    uint32_t    RESERVED40;
    volatile    uint32_t    MTLESTSCHER;
    volatile    uint32_t    MTLESTFSER;
    volatile    uint32_t    MTLESTFSCR;
    volatile    uint32_t    RESERVED41;
    volatile    uint32_t    MTLESTIER;
    volatile    uint32_t    RESERVED42[3];
    volatile    uint32_t    MTLESTGCLCR;
    volatile    uint32_t    MTLESTGCLDR;
    volatile    uint32_t    RESERVED43[2];
    volatile    uint32_t    MTLFPECSR;
    volatile    uint32_t    MTLFPEAR;
    volatile    uint32_t    RESERVED44[26];
    volatile    uint32_t    MTLTXQ0OMR;
    volatile    uint32_t    MTLTXQ0UR;
    volatile    uint32_t    MTLTXQ0DR;
    volatile    uint32_t    RESERVED45[2];
    volatile    uint32_t    MTLTXQ0ESR;
    volatile    uint32_t    MTLTXQ0QWR;
    volatile    uint32_t    RESERVED46[4];
    volatile    uint32_t    MTLQ0ICSR;
    volatile    uint32_t    MTLRXQ0OMR;
    volatile    uint32_t    MTLRXQ0MPOCR;
    volatile    uint32_t    MTLRXQ0DR;
    volatile    uint32_t    MTLRXQ0CR;
    volatile    uint32_t    MTLTXQ1OMR;
    volatile    uint32_t    MTLTXQ1UR;
    volatile    uint32_t    MTLTXQ1DR;
    volatile    uint32_t    RESERVED47;
    volatile    uint32_t    MTLTXQ1ECR;
    volatile    uint32_t    MTLTXQ1ESR;
    volatile    uint32_t    MTLTXQ1QWR;
    volatile    uint32_t    MTLTXQ1SSCR;
    volatile    uint32_t    MTLTXQ1HCR;
    volatile    uint32_t    MTLTXQ1LCR;
    volatile    uint32_t    RESERVED48;
    volatile    uint32_t    MTLQ1ICSR;
    volatile    uint32_t    MTLRXQ1OMR;
    volatile    uint32_t    MTLRXQ1MPOCR;
    volatile    uint32_t    MTLRXQ1DR;
    volatile    uint32_t    MTLRXQ1CR;
    volatile    uint32_t    MTLTXQ2OMR;
    volatile    uint32_t    MTLTXQ2UR;
    volatile    uint32_t    MTLTXQ2DR;
    volatile    uint32_t    RESERVED49;
    volatile    uint32_t    MTLTXQ2ECR;
    volatile    uint32_t    MTLTXQ2ESR;
    volatile    uint32_t    MTLTXQ2QWR;
    volatile    uint32_t    MTLTXQ2SSCR;
    volatile    uint32_t    MTLTXQ2HCR;
    volatile    uint32_t    MTLTXQ2LCR;
    volatile    uint32_t    RESERVED50;
    volatile    uint32_t    MTLQ2ICSR;
    volatile    uint32_t    RESERVED51[4];
    volatile    uint32_t    MTLTXQ3OMR;
    volatile    uint32_t    MTLTXQ3UR;
    volatile    uint32_t    MTLTXQ3DR;
    volatile    uint32_t    RESERVED52;
    volatile    uint32_t    MTLTXQ3ECR;
    volatile    uint32_t    MTLTXQ3ESR;
    volatile    uint32_t    MTLTXQ3QWR;
    volatile    uint32_t    MTLTXQ3SSCR;
    volatile    uint32_t    MTLTXQ3HCR;
    volatile    uint32_t    MTLTXQ3LCR;
    volatile    uint32_t    RESERVED53;
    volatile    uint32_t    MTLQ3ICSR;
    volatile    uint32_t    RESERVED54[132];
    volatile    uint32_t    DMAMR;
    volatile    uint32_t    DMASBMR;
    volatile    uint32_t    DMAISR;
    volatile    uint32_t    DMADS1R;
    volatile    uint32_t    DMADS2R;
    volatile    uint32_t    RESERVED55[3];
    volatile    uint32_t    DMAA4TXACR;
    volatile    uint32_t    DMAA4RXACR;
    volatile    uint32_t    DMAA4DACR;
    volatile    uint32_t    RESERVED56[5];
    volatile    uint32_t    DMALPIEI;
    volatile    uint32_t    RESERVED57[3];
        union {
    volatile    uint32_t    DMATBSCTRL0R;
    volatile    uint32_t    DMATBSCTRL0R_ALTERNATE1;
        };
    volatile    uint32_t    DMATBSCTRL1R;
    volatile    uint32_t    DMATBSCTRL2R;
    volatile    uint32_t    DMATBSCTRL3R;
    volatile    uint32_t    RESERVED58[40];
    volatile    uint32_t    DMAC0CR;
    volatile    uint32_t    DMAC0TXCR;
    volatile    uint32_t    DMAC0RXCR;
    volatile    uint32_t    RESERVED59[2];
    volatile    uint32_t    DMAC0TXDLAR;
    volatile    uint32_t    RESERVED60;
    volatile    uint32_t    DMAC0RXDLAR;
    volatile    uint32_t    DMAC0TXDTPR;
    volatile    uint32_t    RESERVED61;
    volatile    uint32_t    DMAC0RXDTPR;
    volatile    uint32_t    DMAC0TXRLR;
    volatile    uint32_t    DMAC0RXRLR;
    volatile    uint32_t    DMAC0IER;
    volatile    uint32_t    DMAC0RXIWTR;
    volatile    uint32_t    DMAC0SFCSR;
    volatile    uint32_t    RESERVED62;
    volatile    uint32_t    DMAC0CATXDR;
    volatile    uint32_t    RESERVED63;
    volatile    uint32_t    DMAC0CARXDR;
    volatile    uint32_t    RESERVED64;
    volatile    uint32_t    DMAC0CATXBR;
    volatile    uint32_t    RESERVED65;
    volatile    uint32_t    DMAC0CARXBR;
    volatile    uint32_t    DMAC0SR;
    volatile    uint32_t    DMAC0MFCR;
    volatile    uint32_t    RESERVED66[6];
    volatile    uint32_t    DMAC1CR;
    volatile    uint32_t    DMAC1TXCR;
    volatile    uint32_t    DMAC1RXCR;
    volatile    uint32_t    RESERVED67[2];
    volatile    uint32_t    DMAC1TXDLAR;
    volatile    uint32_t    RESERVED68;
    volatile    uint32_t    DMAC1RXDLAR;
    volatile    uint32_t    DMAC1TXDTPR;
    volatile    uint32_t    RESERVED69;
    volatile    uint32_t    DMAC1RXDTPR;
    volatile    uint32_t    DMAC1TXRLR;
    volatile    uint32_t    DMAC1RXRLR;
    volatile    uint32_t    DMAC1IER;
    volatile    uint32_t    DMAC1RXIWTR;
    volatile    uint32_t    DMAC1SFCSR;
    volatile    uint32_t    RESERVED70;
    volatile    uint32_t    DMAC1CATXDR;
    volatile    uint32_t    RESERVED71;
    volatile    uint32_t    DMAC1CARXDR;
    volatile    uint32_t    RESERVED72;
    volatile    uint32_t    DMAC1CATXBR;
    volatile    uint32_t    RESERVED73;
    volatile    uint32_t    DMAC1CARXBR;
    volatile    uint32_t    DMAC1SR;
    volatile    uint32_t    DMAC1MFCR;
    volatile    uint32_t    RESERVED74[6];
    volatile    uint32_t    DMAC2CR;
    volatile    uint32_t    DMAC2TXCR;
    volatile    uint32_t    RESERVED75[3];
    volatile    uint32_t    DMAC2TXDLAR;
    volatile    uint32_t    RESERVED76[2];
    volatile    uint32_t    DMAC2TXDTPR;
    volatile    uint32_t    RESERVED77[2];
    volatile    uint32_t    DMAC2TXRLR;
    volatile    uint32_t    RESERVED78;
    volatile    uint32_t    DMAC2IER;
    volatile    uint32_t    RESERVED79;
    volatile    uint32_t    DMAC2SFCSR;
    volatile    uint32_t    RESERVED80;
    volatile    uint32_t    DMAC2CATXDR;
    volatile    uint32_t    RESERVED81[3];
    volatile    uint32_t    DMAC2CATXBR;
    volatile    uint32_t    RESERVED82[2];
    volatile    uint32_t    DMAC2SR;
    volatile    uint32_t    RESERVED83[7];
    volatile    uint32_t    DMAC3CR;
    volatile    uint32_t    DMAC3TXCR;
    volatile    uint32_t    RESERVED84[3];
    volatile    uint32_t    DMAC3TXDLAR;
    volatile    uint32_t    RESERVED85[2];
    volatile    uint32_t    DMAC3TXDTPR;
    volatile    uint32_t    RESERVED86[2];
    volatile    uint32_t    DMAC3TXRLR;
    volatile    uint32_t    RESERVED87;
    volatile    uint32_t    DMAC3IER;
    volatile    uint32_t    RESERVED88;
    volatile    uint32_t    DMAC3SFCSR;
    volatile    uint32_t    RESERVED89;
    volatile    uint32_t    DMAC3CATXDR;
    volatile    uint32_t    RESERVED90[3];
    volatile    uint32_t    DMAC3CATXBR;
    volatile    uint32_t    RESERVED91[2];
    volatile    uint32_t    DMAC3SR;
} ETH_TypeDef;

#if (defined(__cplusplus))
#define ETH_NS  reinterpret_cast<ETH_TypeDef *>(0x48036000u)
#define ETH_S   reinterpret_cast<ETH_TypeDef *>(0x58036000u)

#else
#define ETH_NS  ((ETH_TypeDef *)0x48036000u)
#define ETH_S   ((ETH_TypeDef *)0x58036000u)
#endif

// MACCR Configuration

#define ETH_MACCR_ARPEN                                             (0x1u<<31)
#define ETH_MACCR_SARC                                              (0x7u<<28)
#define ETH_MACCR_SARC_0                                            (0x1u<<28)
#define ETH_MACCR_IPC                                               (0x1u<<27)
#define ETH_MACCR_IPG                                               (0x7u<<24)
#define ETH_MACCR_IPG_0                                             (0x1u<<24)
#define ETH_MACCR_GPSLCE                                            (0x1u<<23)
#define ETH_MACCR_S2KP                                              (0x1u<<22)
#define ETH_MACCR_CST                                               (0x1u<<21)
#define ETH_MACCR_ACS                                               (0x1u<<20)
#define ETH_MACCR_WD                                                (0x1u<<19)
#define ETH_MACCR_BE                                                (0x1u<<18)
#define ETH_MACCR_JD                                                (0x1u<<17)
#define ETH_MACCR_JE                                                (0x1u<<16)
#define ETH_MACCR_PS                                                (0x1u<<15)
#define ETH_MACCR_FES                                               (0x1u<<14)
#define ETH_MACCR_DM                                                (0x1u<<13)
#define ETH_MACCR_LM                                                (0x1u<<12)
#define ETH_MACCR_ECRSFD                                            (0x1u<<11)
#define ETH_MACCR_DO                                                (0x1u<<10)
#define ETH_MACCR_DCRS                                              (0x1u<<9)
#define ETH_MACCR_DR                                                (0x1u<<8)
#define ETH_MACCR_BL                                                (0x3u<<5)
#define ETH_MACCR_BL_0                                              (0x1u<<5)
#define ETH_MACCR_DC                                                (0x1u<<4)
#define ETH_MACCR_PRELEN                                            (0x3u<<2)
#define ETH_MACCR_PRELEN_0                                          (0x1u<<2)
#define ETH_MACCR_TE                                                (0x1u<<1)
#define ETH_MACCR_RE                                                (0x1u<<0)

#define ETH_MACCR_SARC_B_0X2                                        (0x2u<<28)
#define ETH_MACCR_SARC_B_0X3                                        (0x3u<<28)
#define ETH_MACCR_SARC_B_0X6                                        (0x6u<<28)
#define ETH_MACCR_SARC_B_0X7                                        (0x7u<<28)
#define ETH_MACCR_IPG_B_0X0                                         (0x0u<<24)
#define ETH_MACCR_IPG_B_0X1                                         (0x1u<<24)
#define ETH_MACCR_IPG_B_0X2                                         (0x2u<<24)
#define ETH_MACCR_IPG_B_0X7                                         (0x7u<<24)
#define ETH_MACCR_PS_B_0X0                                          (0x0u<<15)
#define ETH_MACCR_PS_B_0X1                                          (0x1u<<15)
#define ETH_MACCR_FES_B_0X0                                         (0x0u<<14)
#define ETH_MACCR_FES_B_0X1                                         (0x1u<<14)
#define ETH_MACCR_BL_B_0X0                                          (0x0u<<5)
#define ETH_MACCR_BL_B_0X1                                          (0x1u<<5)
#define ETH_MACCR_BL_B_0X2                                          (0x2u<<5)
#define ETH_MACCR_BL_B_0X3                                          (0x3u<<5)
#define ETH_MACCR_PRELEN_B_0X0                                      (0x0u<<2)
#define ETH_MACCR_PRELEN_B_0X1                                      (0x1u<<2)
#define ETH_MACCR_PRELEN_B_0X2                                      (0x2u<<2)
#define ETH_MACCR_PRELEN_B_0X3                                      (0x3u<<2)

// MACECR Configuration

#define ETH_MACECR_APDIM                                            (0x1u<<30)
#define ETH_MACECR_EIPG                                             (0x1Fu<<25)
#define ETH_MACECR_EIPG_0                                           (0x1u<<25)
#define ETH_MACECR_EIPGEN                                           (0x1u<<24)
#define ETH_MACECR_USP                                              (0x1u<<18)
#define ETH_MACECR_SPEN                                             (0x1u<<17)
#define ETH_MACECR_DCRCC                                            (0x1u<<16)
#define ETH_MACECR_GPSL                                             (0x3FFFu<<0)
#define ETH_MACECR_GPSL_0                                           (0x1u<<0)

// MACPFR Configuration

