Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
#define ETH_MACPFR_RA                                               (0x1u<<31)
#define ETH_MACPFR_DNTU                                             (0x1u<<21)
#define ETH_MACPFR_IPFE                                             (0x1u<<20)
#define ETH_MACPFR_VTFE                                             (0x1u<<16)
#define ETH_MACPFR_HPF                                              (0x1u<<10)
#define ETH_MACPFR_SAF                                              (0x1u<<9)
#define ETH_MACPFR_SAIF                                             (0x1u<<8)
#define ETH_MACPFR_PCF                                              (0x3u<<6)
#define ETH_MACPFR_PCF_0                                            (0x1u<<6)
#define ETH_MACPFR_DBF                                              (0x1u<<5)
#define ETH_MACPFR_PM                                               (0x1u<<4)
#define ETH_MACPFR_DAIF                                             (0x1u<<3)
#define ETH_MACPFR_HMC                                              (0x1u<<2)
#define ETH_MACPFR_HUC                                              (0x1u<<1)
#define ETH_MACPFR_PR                                               (0x1u<<0)

#define ETH_MACPFR_PCF_B_0X0                                        (0x0u<<6)
#define ETH_MACPFR_PCF_B_0X1                                        (0x1u<<6)
#define ETH_MACPFR_PCF_B_0X2                                        (0x2u<<6)
#define ETH_MACPFR_PCF_B_0X3                                        (0x3u<<6)

// MACWJBTR Configuration

#define ETH_MACWJBTR_PJE                                            (0x1u<<24)
#define ETH_MACWJBTR_JTO                                            (0xFu<<16)
#define ETH_MACWJBTR_JTO_0                                          (0x1u<<16)
#define ETH_MACWJBTR_PWE                                            (0x1u<<8)
#define ETH_MACWJBTR_WTO                                            (0xFu<<0)
#define ETH_MACWJBTR_WTO_0                                          (0x1u<<0)

#define ETH_MACWJBTR_JTO_B_0X0                                      (0x0u<<16)
#define ETH_MACWJBTR_JTO_B_0X1                                      (0x1u<<16)
#define ETH_MACWJBTR_JTO_B_0X2                                      (0x2u<<16)
#define ETH_MACWJBTR_JTO_B_0X3                                      (0x3u<<16)
#define ETH_MACWJBTR_JTO_B_0XC                                      (0xCu<<16)
#define ETH_MACWJBTR_JTO_B_0XD                                      (0xDu<<16)
#define ETH_MACWJBTR_JTO_B_0XE                                      (0xEu<<16)
#define ETH_MACWJBTR_JTO_B_0XF                                      (0xFu<<16)
#define ETH_MACWJBTR_WTO_B_0X0                                      (0x0u<<0)
#define ETH_MACWJBTR_WTO_B_0X1                                      (0x1u<<0)
#define ETH_MACWJBTR_WTO_B_0X2                                      (0x2u<<0)
#define ETH_MACWJBTR_WTO_B_0X3                                      (0x3u<<0)
#define ETH_MACWJBTR_WTO_B_0XC                                      (0xCu<<0)
#define ETH_MACWJBTR_WTO_B_0XD                                      (0xDu<<0)
#define ETH_MACWJBTR_WTO_B_0XE                                      (0xEu<<0)
#define ETH_MACWJBTR_WTO_B_0XF                                      (0xFu<<0)

// MACHT0R Configuration

#define ETH_MACHT0R_HT31T0                                          (0xFFFFFFFFu<<0)
#define ETH_MACHT0R_HT31T0_0                                        (0x1u<<0)

// MACHT1R Configuration

#define ETH_MACHT1R_HT63T32                                         (0xFFFFFFFFu<<0)
#define ETH_MACHT1R_HT63T32_0                                       (0x1u<<0)

// MACVTCR Configuration

#define ETH_MACVTCR_EIVLRXS                                         (0x1u<<31)
#define ETH_MACVTCR_EIVLS                                           (0x3u<<28)
#define ETH_MACVTCR_EIVLS_0                                         (0x1u<<28)
#define ETH_MACVTCR_ERIVLT                                          (0x1u<<27)
#define ETH_MACVTCR_EDVLP                                           (0x1u<<26)
#define ETH_MACVTCR_VTHM                                            (0x1u<<25)
#define ETH_MACVTCR_EVLRXS                                          (0x1u<<24)
#define ETH_MACVTCR_EVLS                                            (0x3u<<21)
#define ETH_MACVTCR_EVLS_0                                          (0x1u<<21)
#define ETH_MACVTCR_DOVLTC                                          (0x1u<<20)
#define ETH_MACVTCR_ERSVLM                                          (0x1u<<19)
#define ETH_MACVTCR_ESVL                                            (0x1u<<18)
#define ETH_MACVTCR_VTIM                                            (0x1u<<17)
#define ETH_MACVTCR_ETV                                             (0x1u<<16)
#define ETH_MACVTCR_OFS                                             (0x3u<<2)
#define ETH_MACVTCR_OFS_0                                           (0x1u<<2)
#define ETH_MACVTCR_CT                                              (0x1u<<1)
#define ETH_MACVTCR_OB                                              (0x1u<<0)

#define ETH_MACVTCR_EIVLS_B_0X0                                     (0x0u<<28)
#define ETH_MACVTCR_EIVLS_B_0X1                                     (0x1u<<28)
#define ETH_MACVTCR_EIVLS_B_0X2                                     (0x2u<<28)
#define ETH_MACVTCR_EIVLS_B_0X3                                     (0x3u<<28)
#define ETH_MACVTCR_EVLS_B_0X0                                      (0x0u<<21)
#define ETH_MACVTCR_EVLS_B_0X1                                      (0x1u<<21)
#define ETH_MACVTCR_EVLS_B_0X2                                      (0x2u<<21)
#define ETH_MACVTCR_EVLS_B_0X3                                      (0x3u<<21)
#define ETH_MACVTCR_OFS_B_0X0                                       (0x0u<<2)
#define ETH_MACVTCR_OFS_B_0X1                                       (0x1u<<2)
#define ETH_MACVTCR_OFS_B_0X2                                       (0x2u<<2)
#define ETH_MACVTCR_OFS_B_0X3                                       (0x3u<<2)

// MACVTDR Configuration

#define ETH_MACVTDR_DMACHN                                          (0x1u<<25)
#define ETH_MACVTDR_DMACHEN                                         (0x1u<<24)
#define ETH_MACVTDR_ERIVLT                                          (0x1u<<20)
#define ETH_MACVTDR_ERSVLM                                          (0x1u<<19)
#define ETH_MACVTDR_DOVLTC                                          (0x1u<<18)
#define ETH_MACVTDR_ETV                                             (0x1u<<17)
#define ETH_MACVTDR_VEN                                             (0x1u<<16)
#define ETH_MACVTDR_VID                                             (0xFFFFu<<0)
#define ETH_MACVTDR_VID_0                                           (0x1u<<0)

#define ETH_MACVTDR_ETV_B_0X0                                       (0x0u<<17)
#define ETH_MACVTDR_ETV_B_0X1                                       (0x1u<<17)

