Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// MACVHTR Configuration

#define ETH_MACVHTR_VLHT                                            (0xFFFFu<<0)
#define ETH_MACVHTR_VLHT_0                                          (0x1u<<0)

// MACVIR Configuration

#define ETH_MACVIR_BUSY                                             (0x1u<<31)
#define ETH_MACVIR_RDWR                                             (0x1u<<30)
#define ETH_MACVIR_ADDR1                                            (0x1u<<25)
#define ETH_MACVIR_ADDR0                                            (0x1u<<24)
#define ETH_MACVIR_CBTI                                             (0x1u<<21)
#define ETH_MACVIR_VLTI                                             (0x1u<<20)
#define ETH_MACVIR_CSVL                                             (0x1u<<19)
#define ETH_MACVIR_VLP                                              (0x1u<<18)
#define ETH_MACVIR_VLC                                              (0x3u<<16)
#define ETH_MACVIR_VLC_0                                            (0x1u<<16)
#define ETH_MACVIR_VLT                                              (0xFFFFu<<0)
#define ETH_MACVIR_VLT_0                                            (0x1u<<0)

#define ETH_MACVIR_ADDR1_B_0X0                                      (0x0u<<25)
#define ETH_MACVIR_ADDR1_B_0X1                                      (0x1u<<25)
#define ETH_MACVIR_ADDR0_B_0X0                                      (0x0u<<24)
#define ETH_MACVIR_ADDR0_B_0X1                                      (0x1u<<24)
#define ETH_MACVIR_CSVL_B_0X0                                       (0x0u<<19)
#define ETH_MACVIR_CSVL_B_0X1                                       (0x1u<<19)
#define ETH_MACVIR_VLC_B_0X0                                        (0x0u<<16)
#define ETH_MACVIR_VLC_B_0X1                                        (0x1u<<16)
#define ETH_MACVIR_VLC_B_0X2                                        (0x2u<<16)
#define ETH_MACVIR_VLC_B_0X3                                        (0x3u<<16)

// MACVIR_ALTERNATE1 Configuration

#define ETH_MACVIR_ALTERNATE1_CSVL                                  (0x1u<<19)
#define ETH_MACVIR_ALTERNATE1_VLT                                   (0xFFFFu<<0)
#define ETH_MACVIR_ALTERNATE1_VLT_0                                 (0x1u<<0)

#define ETH_MACVIR_ALTERNATE1_CSVL_B_0X0                            (0x0u<<19)
#define ETH_MACVIR_ALTERNATE1_CSVL_B_0X1                            (0x1u<<19)

// MACIVIR Configuration

#define ETH_MACIVIR_VLTI                                            (0x1u<<20)
#define ETH_MACIVIR_CSVL                                            (0x1u<<19)
#define ETH_MACIVIR_VLP                                             (0x1u<<18)
#define ETH_MACIVIR_VLC                                             (0x3u<<16)
#define ETH_MACIVIR_VLC_0                                           (0x1u<<16)
#define ETH_MACIVIR_VLT                                             (0xFFFFu<<0)
#define ETH_MACIVIR_VLT_0                                           (0x1u<<0)

#define ETH_MACIVIR_CSVL_B_0X0                                      (0x0u<<19)
#define ETH_MACIVIR_CSVL_B_0X1                                      (0x1u<<19)
#define ETH_MACIVIR_VLC_B_0X0                                       (0x0u<<16)
#define ETH_MACIVIR_VLC_B_0X1                                       (0x1u<<16)
#define ETH_MACIVIR_VLC_B_0X2                                       (0x2u<<16)
#define ETH_MACIVIR_VLC_B_0X3                                       (0x3u<<16)

// MACQ0TXFCR Configuration

#define ETH_MACQ0TXFCR_PT                                           (0xFFFFu<<16)
#define ETH_MACQ0TXFCR_PT_0                                         (0x1u<<16)
#define ETH_MACQ0TXFCR_DZPQ                                         (0x1u<<7)
#define ETH_MACQ0TXFCR_PLT                                          (0x7u<<4)
#define ETH_MACQ0TXFCR_PLT_0                                        (0x1u<<4)
#define ETH_MACQ0TXFCR_TFE                                          (0x1u<<1)
#define ETH_MACQ0TXFCR_FCB_BPA                                      (0x1u<<0)

#define ETH_MACQ0TXFCR_PLT_B_0X0                                    (0x0u<<4)
#define ETH_MACQ0TXFCR_PLT_B_0X1                                    (0x1u<<4)
#define ETH_MACQ0TXFCR_PLT_B_0X2                                    (0x2u<<4)
#define ETH_MACQ0TXFCR_PLT_B_0X3                                    (0x3u<<4)
#define ETH_MACQ0TXFCR_PLT_B_0X4                                    (0x4u<<4)
#define ETH_MACQ0TXFCR_PLT_B_0X5                                    (0x5u<<4)

// MACRXFCR Configuration

#define ETH_MACRXFCR_UP                                             (0x1u<<1)
#define ETH_MACRXFCR_RFE                                            (0x1u<<0)

// MACRXQCR Configuration

#define ETH_MACRXQCR_VFFQ                                           (0x1u<<17)
#define ETH_MACRXQCR_VFFQE                                          (0x1u<<16)
#define ETH_MACRXQCR_MFFQ                                           (0x1u<<9)
#define ETH_MACRXQCR_MFFQE                                          (0x1u<<8)
#define ETH_MACRXQCR_UFFQ                                           (0x1u<<1)
#define ETH_MACRXQCR_UFFQE                                          (0x1u<<0)

#define ETH_MACRXQCR_VFFQ_B_0X0                                     (0x0u<<17)
#define ETH_MACRXQCR_VFFQ_B_0X1                                     (0x1u<<17)
#define ETH_MACRXQCR_VFFQE_B_0X0                                    (0x0u<<16)
#define ETH_MACRXQCR_VFFQE_B_0X1                                    (0x1u<<16)
#define ETH_MACRXQCR_MFFQ_B_0X0                                     (0x0u<<9)
#define ETH_MACRXQCR_MFFQ_B_0X1                                     (0x1u<<9)
#define ETH_MACRXQCR_UFFQ_B_0X0                                     (0x0u<<1)
#define ETH_MACRXQCR_UFFQ_B_0X1                                     (0x1u<<1)

// MACRXQC0R Configuration

#define ETH_MACRXQC0R_RXQ1EN                                        (0x3u<<2)
#define ETH_MACRXQC0R_RXQ1EN_0                                      (0x1u<<2)
#define ETH_MACRXQC0R_RXQ0EN                                        (0x3u<<0)
#define ETH_MACRXQC0R_RXQ0EN_0                                      (0x1u<<0)

#define ETH_MACRXQC0R_RXQ1EN_B_0X0                                  (0x0u<<2)
#define ETH_MACRXQC0R_RXQ1EN_B_0X1                                  (0x1u<<2)
#define ETH_MACRXQC0R_RXQ1EN_B_0X2                                  (0x2u<<2)
#define ETH_MACRXQC0R_RXQ1EN_B_0X3                                  (0x3u<<2)
#define ETH_MACRXQC0R_RXQ0EN_B_0X0                                  (0x0u<<0)
#define ETH_MACRXQC0R_RXQ0EN_B_0X1                                  (0x1u<<0)
#define ETH_MACRXQC0R_RXQ0EN_B_0X2                                  (0x2u<<0)
#define ETH_MACRXQC0R_RXQ0EN_B_0X3                                  (0x3u<<0)

