Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// MACRXQC1R Configuration

#define ETH_MACRXQC1R_TBRQE                                         (0x1u<<29)
#define ETH_MACRXQC1R_OMCBCQ                                        (0x1u<<28)
#define ETH_MACRXQC1R_FPRQ2                                         (0x1u<<26)
#define ETH_MACRXQC1R_FPRQ1                                         (0x1u<<25)
#define ETH_MACRXQC1R_FPRQ0                                         (0x1u<<24)
#define ETH_MACRXQC1R_TPQC                                          (0x3u<<22)
#define ETH_MACRXQC1R_TPQC_0                                        (0x1u<<22)
#define ETH_MACRXQC1R_TACPQE                                        (0x1u<<21)
#define ETH_MACRXQC1R_MCBCQEN                                       (0x1u<<20)
#define ETH_MACRXQC1R_MCBCQ                                         (0x7u<<16)
#define ETH_MACRXQC1R_MCBCQ_0                                       (0x1u<<16)
#define ETH_MACRXQC1R_UPQ                                           (0x7u<<12)
#define ETH_MACRXQC1R_UPQ_0                                         (0x1u<<12)
#define ETH_MACRXQC1R_PTPQ                                          (0x7u<<4)
#define ETH_MACRXQC1R_PTPQ_0                                        (0x1u<<4)
#define ETH_MACRXQC1R_AVCPQ2                                        (0x1u<<2)
#define ETH_MACRXQC1R_AVCPQ1                                        (0x1u<<1)
#define ETH_MACRXQC1R_AVCPQ0                                        (0x1u<<0)

#define ETH_MACRXQC1R_OMCBCQ_B_0X1                                  (0x1u<<28)
#define ETH_MACRXQC1R_OMCBCQ_B_0X0                                  (0x0u<<28)
#define ETH_MACRXQC1R_FPRQ2_B_0X0                                   (0x0u<<26)
#define ETH_MACRXQC1R_FPRQ2_B_0X1                                   (0x1u<<26)
#define ETH_MACRXQC1R_FPRQ1_B_0X0                                   (0x0u<<25)
#define ETH_MACRXQC1R_FPRQ1_B_0X1                                   (0x1u<<25)
#define ETH_MACRXQC1R_FPRQ0_B_0X0                                   (0x0u<<24)
#define ETH_MACRXQC1R_FPRQ0_B_0X1                                   (0x1u<<24)
#define ETH_MACRXQC1R_TPQC_B_0X0                                    (0x0u<<22)
#define ETH_MACRXQC1R_TPQC_B_0X1                                    (0x1u<<22)
#define ETH_MACRXQC1R_TPQC_B_0X2                                    (0x2u<<22)
#define ETH_MACRXQC1R_MCBCQ_B_0X0                                   (0x0u<<16)
#define ETH_MACRXQC1R_MCBCQ_B_0X1                                   (0x1u<<16)
#define ETH_MACRXQC1R_UPQ_B_0X0                                     (0x0u<<12)
#define ETH_MACRXQC1R_UPQ_B_0X1                                     (0x1u<<12)
#define ETH_MACRXQC1R_PTPQ_B_0X0                                    (0x0u<<4)
#define ETH_MACRXQC1R_PTPQ_B_0X1                                    (0x1u<<4)
#define ETH_MACRXQC1R_AVCPQ2_B_0X0                                  (0x0u<<2)
#define ETH_MACRXQC1R_AVCPQ2_B_0X1                                  (0x1u<<2)
#define ETH_MACRXQC1R_AVCPQ1_B_0X0                                  (0x0u<<1)
#define ETH_MACRXQC1R_AVCPQ1_B_0X1                                  (0x1u<<1)
#define ETH_MACRXQC1R_AVCPQ0_B_0X0                                  (0x0u<<0)
#define ETH_MACRXQC1R_AVCPQ0_B_0X1                                  (0x1u<<0)

// MACRXQC2R Configuration

#define ETH_MACRXQC2R_PSRQ1                                         (0xFFu<<8)
#define ETH_MACRXQC2R_PSRQ1_0                                       (0x1u<<8)
#define ETH_MACRXQC2R_PSRQ0                                         (0xFFu<<0)
#define ETH_MACRXQC2R_PSRQ0_0                                       (0x1u<<0)

// MACISR Configuration

#define ETH_MACISR_B10T1SIS                                         (0x1u<<24)
#define ETH_MACISR_MFRIS                                            (0x1u<<20)
#define ETH_MACISR_MFTIS                                            (0x1u<<19)
#define ETH_MACISR_MDIOIS                                           (0x1u<<18)
#define ETH_MACISR_FPEIS                                            (0x1u<<17)
#define ETH_MACISR_RXSTSIS                                          (0x1u<<14)
#define ETH_MACISR_TXSTSIS                                          (0x1u<<13)
#define ETH_MACISR_TSIS                                             (0x1u<<12)
#define ETH_MACISR_MMCTXIS                                          (0x1u<<10)
#define ETH_MACISR_MMCRXIS                                          (0x1u<<9)
#define ETH_MACISR_MMCIS                                            (0x1u<<8)
#define ETH_MACISR_LPIIS                                            (0x1u<<5)
#define ETH_MACISR_PMTIS                                            (0x1u<<4)
#define ETH_MACISR_PHYIS                                            (0x1u<<3)
#define ETH_MACISR_RGSMIIIS                                         (0x1u<<0)

#define ETH_MACISR_B10T1SIS_B_0X0                                   (0x0u<<24)
#define ETH_MACISR_B10T1SIS_B_0X1                                   (0x1u<<24)

// MACIER Configuration

#define ETH_MACIER_B10T1SIE                                         (0x1u<<19)
#define ETH_MACIER_MDIOIE                                           (0x1u<<18)
#define ETH_MACIER_FPEIE                                            (0x1u<<17)
#define ETH_MACIER_RXSTSIE                                          (0x1u<<14)
#define ETH_MACIER_TXSTSIE                                          (0x1u<<13)
#define ETH_MACIER_TSIE                                             (0x1u<<12)
#define ETH_MACIER_LPIIE                                            (0x1u<<5)
#define ETH_MACIER_PMTIE                                            (0x1u<<4)
#define ETH_MACIER_PHYIE                                            (0x1u<<3)
#define ETH_MACIER_RGSMIIIE                                         (0x1u<<0)

#define ETH_MACIER_B10T1SIE_B_0X0                                   (0x0u<<19)
#define ETH_MACIER_B10T1SIE_B_0X1                                   (0x1u<<19)

// MACRXTXSR Configuration

#define ETH_MACRXTXSR_RWT                                           (0x1u<<8)
#define ETH_MACRXTXSR_EXCOL                                         (0x1u<<5)
#define ETH_MACRXTXSR_LCOL                                          (0x1u<<4)
#define ETH_MACRXTXSR_EXDEF                                         (0x1u<<3)
#define ETH_MACRXTXSR_LCARR                                         (0x1u<<2)
#define ETH_MACRXTXSR_NCARR                                         (0x1u<<1)
#define ETH_MACRXTXSR_TJT                                           (0x1u<<0)

// MACPCSR Configuration

#define ETH_MACPCSR_RWKFILTRST                                      (0x1u<<31)
#define ETH_MACPCSR_RWKPTR                                          (0x1Fu<<24)
#define ETH_MACPCSR_RWKPTR_0                                        (0x1u<<24)
#define ETH_MACPCSR_RWKPFE                                          (0x1u<<10)
#define ETH_MACPCSR_GLBLUCAST                                       (0x1u<<9)
#define ETH_MACPCSR_RWKPRCVD                                        (0x1u<<6)
#define ETH_MACPCSR_MGKPRCVD                                        (0x1u<<5)
#define ETH_MACPCSR_RWKPKTEN                                        (0x1u<<2)
#define ETH_MACPCSR_MGKPKTEN                                        (0x1u<<1)
#define ETH_MACPCSR_PWRDWN                                          (0x1u<<0)

