Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// MACRWKPFR Configuration

#define ETH_MACRWKPFR_MACRWKPFR                                     (0xFFFFFFFFu<<0)
#define ETH_MACRWKPFR_MACRWKPFR_0                                   (0x1u<<0)

// MACLCSR Configuration

#define ETH_MACLCSR_LPITCSE                                         (0x1u<<21)
#define ETH_MACLCSR_LPITE                                           (0x1u<<20)
#define ETH_MACLCSR_LPITXA                                          (0x1u<<19)
#define ETH_MACLCSR_PLSEN                                           (0x1u<<18)
#define ETH_MACLCSR_PLS                                             (0x1u<<17)
#define ETH_MACLCSR_LPIEN                                           (0x1u<<16)
#define ETH_MACLCSR_RLPIST                                          (0x1u<<9)
#define ETH_MACLCSR_TLPIST                                          (0x1u<<8)
#define ETH_MACLCSR_RLPIEX                                          (0x1u<<3)
#define ETH_MACLCSR_RLPIEN                                          (0x1u<<2)
#define ETH_MACLCSR_TLPIEX                                          (0x1u<<1)
#define ETH_MACLCSR_TLPIEN                                          (0x1u<<0)

// MACLTCR Configuration

#define ETH_MACLTCR_LST                                             (0x3FFu<<16)
#define ETH_MACLTCR_LST_0                                           (0x1u<<16)
#define ETH_MACLTCR_TWT                                             (0xFFFFu<<0)
#define ETH_MACLTCR_TWT_0                                           (0x1u<<0)

// MACLETR Configuration

#define ETH_MACLETR_LPIET                                           (0xFFFFFu<<0)
#define ETH_MACLETR_LPIET_0                                         (0x1u<<0)

// MAC1USTCR Configuration

#define ETH_MAC1USTCR_TIC_1US_CNTR                                  (0xFFFu<<0)
#define ETH_MAC1USTCR_TIC_1US_CNTR_0                                (0x1u<<0)

// MACPHYCSR Configuration

#define ETH_MACPHYCSR_LNKSTS                                        (0x1u<<19)
#define ETH_MACPHYCSR_LNKSPEED                                      (0x3u<<17)
#define ETH_MACPHYCSR_LNKSPEED_0                                    (0x1u<<17)
#define ETH_MACPHYCSR_LNKMOD                                        (0x1u<<16)
#define ETH_MACPHYCSR_LUD                                           (0x1u<<1)
#define ETH_MACPHYCSR_TC                                            (0x1u<<0)

#define ETH_MACPHYCSR_LNKSTS_B_0X0                                  (0x0u<<19)
#define ETH_MACPHYCSR_LNKSTS_B_0X1                                  (0x1u<<19)
#define ETH_MACPHYCSR_LNKSPEED_B_0X0                                (0x0u<<17)
#define ETH_MACPHYCSR_LNKSPEED_B_0X1                                (0x1u<<17)
#define ETH_MACPHYCSR_LNKSPEED_B_0X2                                (0x2u<<17)
#define ETH_MACPHYCSR_LNKSPEED_B_0X3                                (0x3u<<17)
#define ETH_MACPHYCSR_LNKMOD_B_0X0                                  (0x0u<<16)
#define ETH_MACPHYCSR_LNKMOD_B_0X1                                  (0x1u<<16)
#define ETH_MACPHYCSR_LUD_B_0X0                                     (0x0u<<1)
#define ETH_MACPHYCSR_LUD_B_0X1                                     (0x1u<<1)

// MACVR Configuration

#define ETH_MACVR_USERVER                                           (0xFFu<<8)
#define ETH_MACVR_USERVER_0                                         (0x1u<<8)
#define ETH_MACVR_SNPSVER                                           (0xFFu<<0)
#define ETH_MACVR_SNPSVER_0                                         (0x1u<<0)

// MACDR Configuration

#define ETH_MACDR_TFCSTS                                            (0x3u<<17)
#define ETH_MACDR_TFCSTS_0                                          (0x1u<<17)
#define ETH_MACDR_TPESTS                                            (0x1u<<16)
#define ETH_MACDR_RFCFCSTS                                          (0x3u<<1)
#define ETH_MACDR_RFCFCSTS_0                                        (0x1u<<1)
#define ETH_MACDR_RPESTS                                            (0x1u<<0)

#define ETH_MACDR_TFCSTS_B_0X0                                      (0x0u<<17)
#define ETH_MACDR_TFCSTS_B_0X1                                      (0x1u<<17)
#define ETH_MACDR_TFCSTS_B_0X2                                      (0x2u<<17)
#define ETH_MACDR_TFCSTS_B_0X3                                      (0x3u<<17)

// MACHWF0R Configuration

#define ETH_MACHWF0R_ACTPHYSEL                                      (0x7u<<28)
#define ETH_MACHWF0R_ACTPHYSEL_0                                    (0x1u<<28)
#define ETH_MACHWF0R_SAVLANINS                                      (0x1u<<27)
#define ETH_MACHWF0R_TSSTSSEL                                       (0x3u<<25)
#define ETH_MACHWF0R_TSSTSSEL_0                                     (0x1u<<25)
#define ETH_MACHWF0R_MACADR64SEL                                    (0x1u<<24)
#define ETH_MACHWF0R_MACADR32SEL                                    (0x1u<<23)
#define ETH_MACHWF0R_ADDMACADRSEL                                   (0x1Fu<<18)
#define ETH_MACHWF0R_ADDMACADRSEL_0                                 (0x1u<<18)
#define ETH_MACHWF0R_RXCOESEL                                       (0x1u<<16)
#define ETH_MACHWF0R_TXCOESEL                                       (0x1u<<14)
#define ETH_MACHWF0R_EEESEL                                         (0x1u<<13)
#define ETH_MACHWF0R_TSSEL                                          (0x1u<<12)
#define ETH_MACHWF0R_ARPOFFSEL                                      (0x1u<<9)
#define ETH_MACHWF0R_MMCSEL                                         (0x1u<<8)
#define ETH_MACHWF0R_MGKSEL                                         (0x1u<<7)
#define ETH_MACHWF0R_RWKSEL                                         (0x1u<<6)
#define ETH_MACHWF0R_SMASEL                                         (0x1u<<5)
#define ETH_MACHWF0R_VLHASH                                         (0x1u<<4)
#define ETH_MACHWF0R_PCSSEL                                         (0x1u<<3)
#define ETH_MACHWF0R_HDSEL                                          (0x1u<<2)
#define ETH_MACHWF0R_GMIISEL                                        (0x1u<<1)
#define ETH_MACHWF0R_MIISEL                                         (0x1u<<0)

#define ETH_MACHWF0R_ACTPHYSEL_B_0X0                                (0x0u<<28)
#define ETH_MACHWF0R_ACTPHYSEL_B_0X1                                (0x1u<<28)
#define ETH_MACHWF0R_ACTPHYSEL_B_0X2                                (0x2u<<28)
#define ETH_MACHWF0R_ACTPHYSEL_B_0X3                                (0x3u<<28)
#define ETH_MACHWF0R_ACTPHYSEL_B_0X4                                (0x4u<<28)
#define ETH_MACHWF0R_ACTPHYSEL_B_0X5                                (0x5u<<28)
#define ETH_MACHWF0R_ACTPHYSEL_B_0X6                                (0x6u<<28)
#define ETH_MACHWF0R_TSSTSSEL_B_0X1                                 (0x1u<<25)
#define ETH_MACHWF0R_TSSTSSEL_B_0X2                                 (0x2u<<25)
#define ETH_MACHWF0R_TSSTSSEL_B_0X3                                 (0x3u<<25)
#define ETH_MACHWF0R_TSSTSSEL_B_0X0                                 (0x0u<<25)

// MACHWF1R Configuration

#define ETH_MACHWF1R_L3L4FNUM                                       (0xFu<<27)
#define ETH_MACHWF1R_L3L4FNUM_0                                     (0x1u<<27)
#define ETH_MACHWF1R_HASHTBLSZ                                      (0x3u<<24)
#define ETH_MACHWF1R_HASHTBLSZ_0                                    (0x1u<<24)
#define ETH_MACHWF1R_POUOST                                         (0x1u<<23)
#define ETH_MACHWF1R_RAVSEL                                         (0x1u<<21)
#define ETH_MACHWF1R_AVSEL                                          (0x1u<<20)
#define ETH_MACHWF1R_DBGMEMA                                        (0x1u<<19)
#define ETH_MACHWF1R_TSOEN                                          (0x1u<<18)
#define ETH_MACHWF1R_SPHEN                                          (0x1u<<17)
#define ETH_MACHWF1R_DCBEN                                          (0x1u<<16)
#define ETH_MACHWF1R_ADDR64                                         (0x3u<<14)
#define ETH_MACHWF1R_ADDR64_0                                       (0x1u<<14)
#define ETH_MACHWF1R_ADVTHWORD                                      (0x1u<<13)
#define ETH_MACHWF1R_PTOEN                                          (0x1u<<12)
#define ETH_MACHWF1R_OSTEN                                          (0x1u<<11)
#define ETH_MACHWF1R_TXFIFOSIZE                                     (0x1Fu<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_0                                   (0x1u<<6)
#define ETH_MACHWF1R_SPRAM                                          (0x1u<<5)
#define ETH_MACHWF1R_RXFIFOSIZE                                     (0x1Fu<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_0                                   (0x1u<<0)

#define ETH_MACHWF1R_L3L4FNUM_B_0X0                                 (0x0u<<27)
#define ETH_MACHWF1R_L3L4FNUM_B_0X1                                 (0x1u<<27)
#define ETH_MACHWF1R_L3L4FNUM_B_0X2                                 (0x2u<<27)
#define ETH_MACHWF1R_L3L4FNUM_B_0X8                                 (0x8u<<27)
#define ETH_MACHWF1R_HASHTBLSZ_B_0X0                                (0x0u<<24)
#define ETH_MACHWF1R_HASHTBLSZ_B_0X1                                (0x1u<<24)
#define ETH_MACHWF1R_HASHTBLSZ_B_0X2                                (0x2u<<24)
#define ETH_MACHWF1R_HASHTBLSZ_B_0X3                                (0x3u<<24)
#define ETH_MACHWF1R_ADDR64_B_0X0                                   (0x0u<<14)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0X0                               (0x0u<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0X1                               (0x1u<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0X2                               (0x2u<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0X3                               (0x3u<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0X4                               (0x4u<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0X5                               (0x5u<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0X6                               (0x6u<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0X7                               (0x7u<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0X8                               (0x8u<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0X9                               (0x9u<<6)
#define ETH_MACHWF1R_TXFIFOSIZE_B_0XA                               (0xAu<<6)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0X0                               (0x0u<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0X1                               (0x1u<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0X2                               (0x2u<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0X3                               (0x3u<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0X4                               (0x4u<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0X5                               (0x5u<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0X6                               (0x6u<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0X7                               (0x7u<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0X8                               (0x8u<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0X9                               (0x9u<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0XA                               (0xAu<<0)
#define ETH_MACHWF1R_RXFIFOSIZE_B_0XB                               (0xBu<<0)

// MACHWF2R Configuration

#define ETH_MACHWF2R_AUXSNAPNUM                                     (0x7u<<28)
#define ETH_MACHWF2R_AUXSNAPNUM_0                                   (0x1u<<28)
#define ETH_MACHWF2R_PPSOUTNUM                                      (0x7u<<24)
#define ETH_MACHWF2R_PPSOUTNUM_0                                    (0x1u<<24)
#define ETH_MACHWF2R_TDCSZ                                          (0x3u<<22)
#define ETH_MACHWF2R_TDCSZ_0                                        (0x1u<<22)
#define ETH_MACHWF2R_TXCHCNT                                        (0xFu<<18)
#define ETH_MACHWF2R_TXCHCNT_0                                      (0x1u<<18)
#define ETH_MACHWF2R_RDCSZ                                          (0x3u<<16)
#define ETH_MACHWF2R_RDCSZ_0                                        (0x1u<<16)
#define ETH_MACHWF2R_RXCHCNT                                        (0xFu<<12)
#define ETH_MACHWF2R_RXCHCNT_0                                      (0x1u<<12)
#define ETH_MACHWF2R_TXQCNT                                         (0xFu<<6)
#define ETH_MACHWF2R_TXQCNT_0                                       (0x1u<<6)
#define ETH_MACHWF2R_RXQCNT                                         (0xFu<<0)
#define ETH_MACHWF2R_RXQCNT_0                                       (0x1u<<0)

#define ETH_MACHWF2R_AUXSNAPNUM_B_0X0                               (0x0u<<28)
#define ETH_MACHWF2R_AUXSNAPNUM_B_0X1                               (0x1u<<28)
#define ETH_MACHWF2R_AUXSNAPNUM_B_0X2                               (0x2u<<28)
#define ETH_MACHWF2R_AUXSNAPNUM_B_0X3                               (0x3u<<28)
#define ETH_MACHWF2R_AUXSNAPNUM_B_0X4                               (0x4u<<28)
#define ETH_MACHWF2R_PPSOUTNUM_B_0X0                                (0x0u<<24)
#define ETH_MACHWF2R_PPSOUTNUM_B_0X1                                (0x1u<<24)
#define ETH_MACHWF2R_PPSOUTNUM_B_0X2                                (0x2u<<24)
#define ETH_MACHWF2R_PPSOUTNUM_B_0X3                                (0x3u<<24)
#define ETH_MACHWF2R_PPSOUTNUM_B_0X4                                (0x4u<<24)
#define ETH_MACHWF2R_TDCSZ_B_0X0                                    (0x0u<<22)
#define ETH_MACHWF2R_TDCSZ_B_0X1                                    (0x1u<<22)
#define ETH_MACHWF2R_TDCSZ_B_0X2                                    (0x2u<<22)
#define ETH_MACHWF2R_TDCSZ_B_0X3                                    (0x3u<<22)
#define ETH_MACHWF2R_TXCHCNT_B_0X0                                  (0x0u<<18)
#define ETH_MACHWF2R_TXCHCNT_B_0X1                                  (0x1u<<18)
#define ETH_MACHWF2R_TXCHCNT_B_0X7                                  (0x7u<<18)
#define ETH_MACHWF2R_RDCSZ_B_0X0                                    (0x0u<<16)
#define ETH_MACHWF2R_RDCSZ_B_0X1                                    (0x1u<<16)
#define ETH_MACHWF2R_RDCSZ_B_0X2                                    (0x2u<<16)
#define ETH_MACHWF2R_RDCSZ_B_0X3                                    (0x3u<<16)
#define ETH_MACHWF2R_RXCHCNT_B_0X0                                  (0x0u<<12)
#define ETH_MACHWF2R_RXCHCNT_B_0X1                                  (0x1u<<12)
#define ETH_MACHWF2R_RXCHCNT_B_0X7                                  (0x7u<<12)
#define ETH_MACHWF2R_TXQCNT_B_0X0                                   (0x0u<<6)
#define ETH_MACHWF2R_TXQCNT_B_0X1                                   (0x1u<<6)
#define ETH_MACHWF2R_TXQCNT_B_0X7                                   (0x7u<<6)
#define ETH_MACHWF2R_RXQCNT_B_0X0                                   (0x0u<<0)
#define ETH_MACHWF2R_RXQCNT_B_0X1                                   (0x1u<<0)
#define ETH_MACHWF2R_RXQCNT_B_0X7                                   (0x7u<<0)

