Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// MACHWF3R Configuration

#define ETH_MACHWF3R_ASP                                            (0x3u<<28)
#define ETH_MACHWF3R_ASP_0                                          (0x1u<<28)
#define ETH_MACHWF3R_TBSSEL                                         (0x1u<<27)
#define ETH_MACHWF3R_FPESEL                                         (0x1u<<26)
#define ETH_MACHWF3R_ESTWID                                         (0x3u<<20)
#define ETH_MACHWF3R_ESTWID_0                                       (0x1u<<20)
#define ETH_MACHWF3R_ESTDEP                                         (0x7u<<17)
#define ETH_MACHWF3R_ESTDEP_0                                       (0x1u<<17)
#define ETH_MACHWF3R_ESTSEL                                         (0x1u<<16)
#define ETH_MACHWF3R_FRPES                                          (0x3u<<13)
#define ETH_MACHWF3R_FRPES_0                                        (0x1u<<13)
#define ETH_MACHWF3R_FRPBS                                          (0x3u<<11)
#define ETH_MACHWF3R_FRPBS_0                                        (0x1u<<11)
#define ETH_MACHWF3R_FRPSEL                                         (0x1u<<10)
#define ETH_MACHWF3R_PDUPSEL                                        (0x1u<<9)
#define ETH_MACHWF3R_DVLAN                                          (0x1u<<5)
#define ETH_MACHWF3R_CBTISEL                                        (0x1u<<4)
#define ETH_MACHWF3R_NRVF                                           (0x7u<<0)
#define ETH_MACHWF3R_NRVF_0                                         (0x1u<<0)

#define ETH_MACHWF3R_ASP_B_0X0                                      (0x0u<<28)
#define ETH_MACHWF3R_ASP_B_0X1                                      (0x1u<<28)
#define ETH_MACHWF3R_ASP_B_0X2                                      (0x2u<<28)
#define ETH_MACHWF3R_ASP_B_0X3                                      (0x3u<<28)
#define ETH_MACHWF3R_ESTWID_B_0X0                                   (0x0u<<20)
#define ETH_MACHWF3R_ESTWID_B_0X1                                   (0x1u<<20)
#define ETH_MACHWF3R_ESTWID_B_0X2                                   (0x2u<<20)
#define ETH_MACHWF3R_ESTWID_B_0X3                                   (0x3u<<20)
#define ETH_MACHWF3R_ESTDEP_B_0X0                                   (0x0u<<17)
#define ETH_MACHWF3R_ESTDEP_B_0X1                                   (0x1u<<17)
#define ETH_MACHWF3R_ESTDEP_B_0X2                                   (0x2u<<17)
#define ETH_MACHWF3R_ESTDEP_B_0X3                                   (0x3u<<17)
#define ETH_MACHWF3R_ESTDEP_B_0X4                                   (0x4u<<17)
#define ETH_MACHWF3R_ESTDEP_B_0X5                                   (0x5u<<17)
#define ETH_MACHWF3R_ESTDEP_B_0X6                                   (0x6u<<17)
#define ETH_MACHWF3R_FRPES_B_0X0                                    (0x0u<<13)
#define ETH_MACHWF3R_FRPES_B_0X1                                    (0x1u<<13)
#define ETH_MACHWF3R_FRPES_B_0X2                                    (0x2u<<13)
#define ETH_MACHWF3R_FRPES_B_0X3                                    (0x3u<<13)
#define ETH_MACHWF3R_FRPBS_B_0X0                                    (0x0u<<11)
#define ETH_MACHWF3R_FRPBS_B_0X1                                    (0x1u<<11)
#define ETH_MACHWF3R_FRPBS_B_0X2                                    (0x2u<<11)
#define ETH_MACHWF3R_FRPBS_B_0X3                                    (0x3u<<11)
#define ETH_MACHWF3R_NRVF_B_0X0                                     (0x0u<<0)
#define ETH_MACHWF3R_NRVF_B_0X1                                     (0x1u<<0)
#define ETH_MACHWF3R_NRVF_B_0X2                                     (0x2u<<0)
#define ETH_MACHWF3R_NRVF_B_0X3                                     (0x3u<<0)
#define ETH_MACHWF3R_NRVF_B_0X4                                     (0x4u<<0)
#define ETH_MACHWF3R_NRVF_B_0X5                                     (0x5u<<0)

// MACMDIOAR Configuration

#define ETH_MACMDIOAR_PSE                                           (0x1u<<27)
#define ETH_MACMDIOAR_BTB                                           (0x1u<<26)
#define ETH_MACMDIOAR_PA                                            (0x1Fu<<21)
#define ETH_MACMDIOAR_PA_0                                          (0x1u<<21)
#define ETH_MACMDIOAR_RDA                                           (0x1Fu<<16)
#define ETH_MACMDIOAR_RDA_0                                         (0x1u<<16)
#define ETH_MACMDIOAR_NTC                                           (0x7u<<12)
#define ETH_MACMDIOAR_NTC_0                                         (0x1u<<12)
#define ETH_MACMDIOAR_CR                                            (0xFu<<8)
#define ETH_MACMDIOAR_CR_0                                          (0x1u<<8)
#define ETH_MACMDIOAR_SKAP                                          (0x1u<<4)
#define ETH_MACMDIOAR_GOC                                           (0x3u<<2)
#define ETH_MACMDIOAR_GOC_0                                         (0x1u<<2)
#define ETH_MACMDIOAR_C45E                                          (0x1u<<1)
#define ETH_MACMDIOAR_GB                                            (0x1u<<0)

#define ETH_MACMDIOAR_CR_B_0X0                                      (0x0u<<8)
#define ETH_MACMDIOAR_CR_B_0X1                                      (0x1u<<8)
#define ETH_MACMDIOAR_CR_B_0X2                                      (0x2u<<8)
#define ETH_MACMDIOAR_CR_B_0X3                                      (0x3u<<8)
#define ETH_MACMDIOAR_CR_B_0X4                                      (0x4u<<8)
#define ETH_MACMDIOAR_CR_B_0X5                                      (0x5u<<8)
#define ETH_MACMDIOAR_CR_B_0X6                                      (0x6u<<8)
#define ETH_MACMDIOAR_CR_B_0X7                                      (0x7u<<8)
#define ETH_MACMDIOAR_CR_B_0X8                                      (0x8u<<8)
#define ETH_MACMDIOAR_CR_B_0X9                                      (0x9u<<8)
#define ETH_MACMDIOAR_CR_B_0XA                                      (0xAu<<8)
#define ETH_MACMDIOAR_CR_B_0XB                                      (0xBu<<8)
#define ETH_MACMDIOAR_CR_B_0XC                                      (0xCu<<8)
#define ETH_MACMDIOAR_CR_B_0XD                                      (0xDu<<8)
#define ETH_MACMDIOAR_CR_B_0XE                                      (0xEu<<8)
#define ETH_MACMDIOAR_CR_B_0XF                                      (0xFu<<8)
#define ETH_MACMDIOAR_GOC_B_0X0                                     (0x0u<<2)
#define ETH_MACMDIOAR_GOC_B_0X1                                     (0x1u<<2)
#define ETH_MACMDIOAR_GOC_B_0X2                                     (0x2u<<2)
#define ETH_MACMDIOAR_GOC_B_0X3                                     (0x3u<<2)

// MACMDIODR Configuration

#define ETH_MACMDIODR_RA                                            (0xFFFFu<<16)
#define ETH_MACMDIODR_RA_0                                          (0x1u<<16)
#define ETH_MACMDIODR_GD                                            (0xFFFFu<<0)
#define ETH_MACMDIODR_GD_0                                          (0x1u<<0)

// B10T1S_PLCA_CR Configuration

#define ETH_B10T1S_PLCA_CR_PLCA_R                                   (0x1u<<15)
#define ETH_B10T1S_PLCA_CR_PLCA_EN                                  (0x1u<<14)
#define ETH_B10T1S_PLCA_CR_MAX_BC                                   (0xFFu<<0)
#define ETH_B10T1S_PLCA_CR_MAX_BC_0                                 (0x1u<<0)

#define ETH_B10T1S_PLCA_CR_PLCA_R_B_0X0                             (0x0u<<15)
#define ETH_B10T1S_PLCA_CR_PLCA_R_B_0X1                             (0x1u<<15)
#define ETH_B10T1S_PLCA_CR_PLCA_EN_B_0X0                            (0x0u<<14)
#define ETH_B10T1S_PLCA_CR_PLCA_EN_B_0X1                            (0x1u<<14)

