Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// B10T1S_PLCA_NODECR Configuration

#define ETH_B10T1S_PLCA_NODECR_LNI                                  (0xFFu<<8)
#define ETH_B10T1S_PLCA_NODECR_LNI_0                                (0x1u<<8)
#define ETH_B10T1S_PLCA_NODECR_PNC                                  (0xFFu<<0)
#define ETH_B10T1S_PLCA_NODECR_PNC_0                                (0x1u<<0)

// 10BT1S_PLCA_TMR Configuration

#define ETH_10BT1S_PLCA_TMR_BT                                      (0xFFu<<8)
#define ETH_10BT1S_PLCA_TMR_BT_0                                    (0x1u<<8)
#define ETH_10BT1S_PLCA_TMR_TOT                                     (0xFFu<<0)
#define ETH_10BT1S_PLCA_TMR_TOT_0                                   (0x1u<<0)

// B10T1S_PLCA_SR Configuration

#define ETH_B10T1S_PLCA_SR_RXINTO                                   (0x1u<<3)
#define ETH_B10T1S_PLCA_SR_UNEXPB                                   (0x1u<<2)
#define ETH_B10T1S_PLCA_SR_BCNBFTO                                  (0x1u<<1)
#define ETH_B10T1S_PLCA_SR_PS                                       (0x1u<<0)

#define ETH_B10T1S_PLCA_SR_RXINTO_B_0X0                             (0x0u<<3)
#define ETH_B10T1S_PLCA_SR_RXINTO_B_0X1                             (0x1u<<3)
#define ETH_B10T1S_PLCA_SR_UNEXPB_B_0X0                             (0x0u<<2)
#define ETH_B10T1S_PLCA_SR_UNEXPB_B_0X1                             (0x1u<<2)
#define ETH_B10T1S_PLCA_SR_BCNBFTO_B_0X0                            (0x0u<<1)
#define ETH_B10T1S_PLCA_SR_BCNBFTO_B_0X1                            (0x1u<<1)
#define ETH_B10T1S_PLCA_SR_PS_B_0X1                                 (0x1u<<0)
#define ETH_B10T1S_PLCA_SR_PS_B_0X0                                 (0x0u<<0)

// B10T1S_PCS_CR Configuration

#define ETH_B10T1S_PCS_CR_PCS_R                                     (0x1u<<15)
#define ETH_B10T1S_PCS_CR_LB                                        (0x1u<<14)
#define ETH_B10T1S_PCS_CR_PCS_COL                                   (0x1u<<9)
#define ETH_B10T1S_PCS_CR_DM                                        (0x1u<<8)

#define ETH_B10T1S_PCS_CR_PCS_R_B_0X0                               (0x0u<<15)
#define ETH_B10T1S_PCS_CR_PCS_R_B_0X1                               (0x1u<<15)
#define ETH_B10T1S_PCS_CR_LB_B_0X0                                  (0x0u<<14)
#define ETH_B10T1S_PCS_CR_LB_B_0X1                                  (0x1u<<14)
#define ETH_B10T1S_PCS_CR_PCS_COL_B_0X0                             (0x0u<<9)
#define ETH_B10T1S_PCS_CR_PCS_COL_B_0X1                             (0x1u<<9)
#define ETH_B10T1S_PCS_CR_DM_B_0X0                                  (0x0u<<8)
#define ETH_B10T1S_PCS_CR_DM_B_0X1                                  (0x1u<<8)

// B10T1S_PCS_SR Configuration

#define ETH_B10T1S_PCS_SR_FAULT                                     (0x1u<<7)

#define ETH_B10T1S_PCS_SR_FAULT_B_0X0                               (0x0u<<7)
#define ETH_B10T1S_PCS_SR_FAULT_B_0X1                               (0x1u<<7)

// B10T1S_PCS_DIAG1 Configuration

#define ETH_B10T1S_PCS_DIAG1_RJC                                    (0xFFFFu<<0)
#define ETH_B10T1S_PCS_DIAG1_RJC_0                                  (0x1u<<0)

// B10T1S_PCS_DIAG2 Configuration

#define ETH_B10T1S_PCS_DIAG2_CTC                                    (0xFFFFu<<0)
#define ETH_B10T1S_PCS_DIAG2_CTC_0                                  (0x1u<<0)

// B10T1S_PCS_JBTMR Configuration

#define ETH_B10T1S_PCS_JBTMR_PJT                                    (0xFFFFu<<0)
#define ETH_B10T1S_PCS_JBTMR_PJT_0                                  (0x1u<<0)

// B10T1S_PMA_EXTABLTY Configuration

#define ETH_B10T1S_PMA_EXTABLTY_T1SA                                (0x1u<<3)

#define ETH_B10T1S_PMA_EXTABLTY_T1SA_B_0X1                          (0x1u<<3)
#define ETH_B10T1S_PMA_EXTABLTY_T1SA_B_0X0                          (0x0u<<3)

// B10T1S_PMA_PMD_CR Configuration

#define ETH_B10T1S_PMA_PMD_CR_MSCV                                  (0x1u<<14)
#define ETH_B10T1S_PMA_PMD_CR_TS                                    (0xFu<<0)
#define ETH_B10T1S_PMA_PMD_CR_TS_0                                  (0x1u<<0)

#define ETH_B10T1S_PMA_PMD_CR_MSCV_B_0X1                            (0x1u<<14)
#define ETH_B10T1S_PMA_PMD_CR_MSCV_B_0X0                            (0x0u<<14)
#define ETH_B10T1S_PMA_PMD_CR_TS_B_0X3                              (0x3u<<0)

// B10T1S_PMA_CR Configuration

#define ETH_B10T1S_PMA_CR_PMA_R                                     (0x1u<<15)
#define ETH_B10T1S_PMA_CR_TD                                        (0x1u<<14)
#define ETH_B10T1S_PMA_CR_LP                                        (0x1u<<11)
#define ETH_B10T1S_PMA_CR_MM                                        (0x1u<<10)
#define ETH_B10T1S_PMA_CR_EBRTH                                     (0x1Fu<<1)
#define ETH_B10T1S_PMA_CR_EBRTH_0                                   (0x1u<<1)
#define ETH_B10T1S_PMA_CR_LB                                        (0x1u<<0)

#define ETH_B10T1S_PMA_CR_PMA_R_B_0X1                               (0x1u<<15)
#define ETH_B10T1S_PMA_CR_PMA_R_B_0X0                               (0x0u<<15)
#define ETH_B10T1S_PMA_CR_TD_B_0X1                                  (0x1u<<14)
#define ETH_B10T1S_PMA_CR_TD_B_0X0                                  (0x0u<<14)
#define ETH_B10T1S_PMA_CR_LP_B_0X1                                  (0x1u<<11)
#define ETH_B10T1S_PMA_CR_LP_B_0X0                                  (0x0u<<11)
#define ETH_B10T1S_PMA_CR_MM_B_0X0                                  (0x0u<<10)
#define ETH_B10T1S_PMA_CR_MM_B_0X1                                  (0x1u<<10)
#define ETH_B10T1S_PMA_CR_LB_B_0X0                                  (0x0u<<0)
#define ETH_B10T1S_PMA_CR_LB_B_0X1                                  (0x1u<<0)

// B10T1S_PMA_SR Configuration

#define ETH_B10T1S_PMA_SR_LBA                                       (0x1u<<13)
#define ETH_B10T1S_PMA_SR_LPA                                       (0x1u<<11)
#define ETH_B10T1S_PMA_SR_MMA                                       (0x1u<<10)
#define ETH_B10T1S_PMA_SR_RFA                                       (0x1u<<9)
#define ETH_B10T1S_PMA_SR_RFD                                       (0x1u<<1)

#define ETH_B10T1S_PMA_SR_LBA_B_0X1                                 (0x1u<<13)
#define ETH_B10T1S_PMA_SR_LBA_B_0X0                                 (0x0u<<13)
#define ETH_B10T1S_PMA_SR_LPA_B_0X1                                 (0x1u<<11)
#define ETH_B10T1S_PMA_SR_LPA_B_0X0                                 (0x0u<<11)
#define ETH_B10T1S_PMA_SR_MMA_B_0X1                                 (0x1u<<10)
#define ETH_B10T1S_PMA_SR_MMA_B_0X0                                 (0x0u<<10)
#define ETH_B10T1S_PMA_SR_RFA_B_0X1                                 (0x1u<<9)
#define ETH_B10T1S_PMA_SR_RFA_B_0X0                                 (0x0u<<9)
#define ETH_B10T1S_PMA_SR_RFD_B_0X1                                 (0x1u<<1)
#define ETH_B10T1S_PMA_SR_RFD_B_0X0                                 (0x0u<<1)

// B10T1S_PMA_TMCR Configuration

#define ETH_B10T1S_PMA_TMCR_TMC                                     (0x7u<<13)
#define ETH_B10T1S_PMA_TMCR_TMC_0                                   (0x1u<<13)

#define ETH_B10T1S_PMA_TMCR_TMC_B_0X0                               (0x0u<<13)
#define ETH_B10T1S_PMA_TMCR_TMC_B_0X3                               (0x3u<<13)
#define ETH_B10T1S_PMA_TMCR_TMC_B_0X2                               (0x2u<<13)
#define ETH_B10T1S_PMA_TMCR_TMC_B_0X1                               (0x1u<<13)
#define ETH_B10T1S_PMA_TMCR_TMC_B_0X4                               (0x4u<<13)

// B10T1S_PMA_DR Configuration

