Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
#define ETH_B10T1S_PMA_DR_PDB                                       (0x1u<<1)
#define ETH_B10T1S_PMA_DR_PSB                                       (0x1u<<0)

#define ETH_B10T1S_PMA_DR_PDB_B_0X0                                 (0x0u<<1)
#define ETH_B10T1S_PMA_DR_PDB_B_0X1                                 (0x1u<<1)
#define ETH_B10T1S_PMA_DR_PSB_B_0X0                                 (0x0u<<0)
#define ETH_B10T1S_PMA_DR_PSB_B_0X1                                 (0x1u<<0)

// B10T1S_XCVR_PHYID_LSB Configuration

#define ETH_B10T1S_XCVR_PHYID_LSB_PHY_ID_LSB                        (0xFFFFu<<0)
#define ETH_B10T1S_XCVR_PHYID_LSB_PHY_ID_LSB_0                      (0x1u<<0)

// B10T1S_XCVR_PHYID_MSB Configuration

#define ETH_B10T1S_XCVR_PHYID_MSB_PHY_ID_MSB                        (0xFFFFu<<0)
#define ETH_B10T1S_XCVR_PHYID_MSB_PHY_ID_MSB_0                      (0x1u<<0)

// B10T1S_XCVR_MIIMCTRL Configuration

#define ETH_B10T1S_XCVR_MIIMCTRL_RESET                              (0x1u<<15)
#define ETH_B10T1S_XCVR_MIIMCTRL_LOOPBACK                           (0x1u<<14)

// MACARPAR Configuration

#define ETH_MACARPAR_ARPPA                                          (0xFFFFFFFFu<<0)
#define ETH_MACARPAR_ARPPA_0                                        (0x1u<<0)

// MAC10BT1SCR Configuration

#define ETH_MAC10BT1SCR_TS                                          (0x7u<<16)
#define ETH_MAC10BT1SCR_TS_0                                        (0x1u<<16)
#define ETH_MAC10BT1SCR_LWS                                         (0x1u<<9)
#define ETH_MAC10BT1SCR_RWS                                         (0x1u<<8)
#define ETH_MAC10BT1SCR_RCF                                         (0x3u<<6)
#define ETH_MAC10BT1SCR_RCF_0                                       (0x1u<<6)
#define ETH_MAC10BT1SCR_WKPT                                        (0x7u<<2)
#define ETH_MAC10BT1SCR_WKPT_0                                      (0x1u<<2)
#define ETH_MAC10BT1SCR_LPRC                                        (0x1u<<1)
#define ETH_MAC10BT1SCR_RAT                                         (0x1u<<0)

#define ETH_MAC10BT1SCR_TS_B_0X0                                    (0x0u<<16)
#define ETH_MAC10BT1SCR_TS_B_0X1                                    (0x1u<<16)
#define ETH_MAC10BT1SCR_TS_B_0X2                                    (0x2u<<16)
#define ETH_MAC10BT1SCR_TS_B_0X3                                    (0x3u<<16)
#define ETH_MAC10BT1SCR_TS_B_0X4                                    (0x4u<<16)
#define ETH_MAC10BT1SCR_RCF_B_0X0                                   (0x0u<<6)
#define ETH_MAC10BT1SCR_RCF_B_0X1                                   (0x1u<<6)
#define ETH_MAC10BT1SCR_RCF_B_0X2                                   (0x2u<<6)
#define ETH_MAC10BT1SCR_RCF_B_0X3                                   (0x3u<<6)
#define ETH_MAC10BT1SCR_WKPT_B_0X0                                  (0x0u<<2)
#define ETH_MAC10BT1SCR_WKPT_B_0X1                                  (0x1u<<2)
#define ETH_MAC10BT1SCR_WKPT_B_0X2                                  (0x2u<<2)
#define ETH_MAC10BT1SCR_WKPT_B_0X3                                  (0x3u<<2)
#define ETH_MAC10BT1SCR_WKPT_B_0X4                                  (0x4u<<2)
#define ETH_MAC10BT1SCR_WKPT_B_0X5                                  (0x5u<<2)
#define ETH_MAC10BT1SCR_WKPT_B_0X6                                  (0x6u<<2)
#define ETH_MAC10BT1SCR_WKPT_B_0X7                                  (0x7u<<2)
#define ETH_MAC10BT1SCR_RAT_B_0X0                                   (0x0u<<0)
#define ETH_MAC10BT1SCR_RAT_B_0X1                                   (0x1u<<0)

// MACCSRSWCR Configuration

#define ETH_MACCSRSWCR_SEEN                                         (0x1u<<8)
#define ETH_MACCSRSWCR_RCWE                                         (0x1u<<0)

// MACFPECSR Configuration

#define ETH_MACFPECSR_TRSP                                          (0x1u<<19)
#define ETH_MACFPECSR_TVER                                          (0x1u<<18)
#define ETH_MACFPECSR_RRSP                                          (0x1u<<17)
#define ETH_MACFPECSR_RVER                                          (0x1u<<16)
#define ETH_MACFPECSR_ARV                                           (0x1u<<3)
#define ETH_MACFPECSR_SRSP                                          (0x1u<<2)
#define ETH_MACFPECSR_SVER                                          (0x1u<<1)
#define ETH_MACFPECSR_EFPE                                          (0x1u<<0)

// MACPRSTIMR Configuration

#define ETH_MACPRSTIMR_MPTN                                         (0xFFFFFFFFu<<0)
#define ETH_MACPRSTIMR_MPTN_0                                       (0x1u<<0)

// MACPRSTIMUR Configuration

#define ETH_MACPRSTIMUR_MPTU                                        (0xFFFFFFFFu<<0)
#define ETH_MACPRSTIMUR_MPTU_0                                      (0x1u<<0)

// MACA0HR Configuration

#define ETH_MACA0HR_AE                                              (0x1u<<31)
#define ETH_MACA0HR_DCS                                             (0x1u<<16)
#define ETH_MACA0HR_ADDRHI                                          (0xFFFFu<<0)
#define ETH_MACA0HR_ADDRHI_0                                        (0x1u<<0)

#define ETH_MACA0HR_DCS_B_0X0                                       (0x0u<<16)
#define ETH_MACA0HR_DCS_B_0X1                                       (0x1u<<16)

// MACA0LR Configuration

#define ETH_MACA0LR_ADDRLO                                          (0xFFFFFFFFu<<0)
#define ETH_MACA0LR_ADDRLO_0                                        (0x1u<<0)

// MACA1HR Configuration

#define ETH_MACA1HR_AE                                              (0x1u<<31)
#define ETH_MACA1HR_SA                                              (0x1u<<30)
#define ETH_MACA1HR_MBC                                             (0x3Fu<<24)
#define ETH_MACA1HR_MBC_0                                           (0x1u<<24)
#define ETH_MACA1HR_DCS                                             (0x1u<<16)
#define ETH_MACA1HR_ADDRHI                                          (0xFFFFu<<0)
#define ETH_MACA1HR_ADDRHI_0                                        (0x1u<<0)

#define ETH_MACA1HR_SA_B_0X0                                        (0x0u<<30)
#define ETH_MACA1HR_SA_B_0X1                                        (0x1u<<30)
#define ETH_MACA1HR_DCS_B_0X0                                       (0x0u<<16)
#define ETH_MACA1HR_DCS_B_0X1                                       (0x1u<<16)

// MACA1LR Configuration

#define ETH_MACA1LR_ADDRLO                                          (0xFFFFFFFFu<<0)
#define ETH_MACA1LR_ADDRLO_0                                        (0x1u<<0)

