Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// MACA2HR Configuration

#define ETH_MACA2HR_AE                                              (0x1u<<31)
#define ETH_MACA2HR_SA                                              (0x1u<<30)
#define ETH_MACA2HR_MBC                                             (0x3Fu<<24)
#define ETH_MACA2HR_MBC_0                                           (0x1u<<24)
#define ETH_MACA2HR_DCS                                             (0x1u<<16)
#define ETH_MACA2HR_ADDRHI                                          (0xFFFFu<<0)
#define ETH_MACA2HR_ADDRHI_0                                        (0x1u<<0)

#define ETH_MACA2HR_SA_B_0X0                                        (0x0u<<30)
#define ETH_MACA2HR_SA_B_0X1                                        (0x1u<<30)
#define ETH_MACA2HR_DCS_B_0X0                                       (0x0u<<16)
#define ETH_MACA2HR_DCS_B_0X1                                       (0x1u<<16)

// MACA2LR Configuration

#define ETH_MACA2LR_ADDRLO                                          (0xFFFFFFFFu<<0)
#define ETH_MACA2LR_ADDRLO_0                                        (0x1u<<0)

// MACA3HR Configuration

#define ETH_MACA3HR_AE                                              (0x1u<<31)
#define ETH_MACA3HR_SA                                              (0x1u<<30)
#define ETH_MACA3HR_MBC                                             (0x3Fu<<24)
#define ETH_MACA3HR_MBC_0                                           (0x1u<<24)
#define ETH_MACA3HR_DCS                                             (0x1u<<16)
#define ETH_MACA3HR_ADDRHI                                          (0xFFFFu<<0)
#define ETH_MACA3HR_ADDRHI_0                                        (0x1u<<0)

#define ETH_MACA3HR_SA_B_0X0                                        (0x0u<<30)
#define ETH_MACA3HR_SA_B_0X1                                        (0x1u<<30)
#define ETH_MACA3HR_DCS_B_0X0                                       (0x0u<<16)
#define ETH_MACA3HR_DCS_B_0X1                                       (0x1u<<16)

// MACA3LR Configuration

#define ETH_MACA3LR_ADDRLO                                          (0xFFFFFFFFu<<0)
#define ETH_MACA3LR_ADDRLO_0                                        (0x1u<<0)

// MMC_CONTROL Configuration

#define ETH_MMC_CONTROL_UCDBC                                       (0x1u<<8)
#define ETH_MMC_CONTROL_CNTPRSTLVL                                  (0x1u<<5)
#define ETH_MMC_CONTROL_CNTPRST                                     (0x1u<<4)
#define ETH_MMC_CONTROL_CNTFREEZ                                    (0x1u<<3)
#define ETH_MMC_CONTROL_RSTONRD                                     (0x1u<<2)
#define ETH_MMC_CONTROL_CNTSTOPRO                                   (0x1u<<1)
#define ETH_MMC_CONTROL_CNTRST                                      (0x1u<<0)

// MMC_RX_INTERRUPT Configuration

#define ETH_MMC_RX_INTERRUPT_RXLPITRCIS                             (0x1u<<27)
#define ETH_MMC_RX_INTERRUPT_RXLPIUSCIS                             (0x1u<<26)
#define ETH_MMC_RX_INTERRUPT_RXCTRLPIS                              (0x1u<<25)
#define ETH_MMC_RX_INTERRUPT_RXRCVERRPIS                            (0x1u<<24)
#define ETH_MMC_RX_INTERRUPT_RXWDOGPIS                              (0x1u<<23)
#define ETH_MMC_RX_INTERRUPT_RXVLANGBPIS                            (0x1u<<22)
#define ETH_MMC_RX_INTERRUPT_RXFOVPIS                               (0x1u<<21)
#define ETH_MMC_RX_INTERRUPT_RXPAUSPIS                              (0x1u<<20)
#define ETH_MMC_RX_INTERRUPT_RXORANGEPIS                            (0x1u<<19)
#define ETH_MMC_RX_INTERRUPT_RXLENERPIS                             (0x1u<<18)
#define ETH_MMC_RX_INTERRUPT_RXUCGPIS                               (0x1u<<17)
#define ETH_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS                     (0x1u<<16)
#define ETH_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS                     (0x1u<<15)
#define ETH_MMC_RX_INTERRUPT_RX256T511OCTGBPIS                      (0x1u<<14)
#define ETH_MMC_RX_INTERRUPT_RX128T255OCTGBPIS                      (0x1u<<13)
#define ETH_MMC_RX_INTERRUPT_RX65T127OCTGBPIS                       (0x1u<<12)
#define ETH_MMC_RX_INTERRUPT_RX64OCTGBPIS                           (0x1u<<11)
#define ETH_MMC_RX_INTERRUPT_RXOSIZEGPIS                            (0x1u<<10)
#define ETH_MMC_RX_INTERRUPT_RXUSIZEGPIS                            (0x1u<<9)
#define ETH_MMC_RX_INTERRUPT_RXJABERPIS                             (0x1u<<8)
#define ETH_MMC_RX_INTERRUPT_RXRUNTPIS                              (0x1u<<7)
#define ETH_MMC_RX_INTERRUPT_RXALGNERPIS                            (0x1u<<6)
#define ETH_MMC_RX_INTERRUPT_RXCRCERPIS                             (0x1u<<5)
#define ETH_MMC_RX_INTERRUPT_RXMCGPIS                               (0x1u<<4)
#define ETH_MMC_RX_INTERRUPT_RXBCGPIS                               (0x1u<<3)
#define ETH_MMC_RX_INTERRUPT_RXGOCTIS                               (0x1u<<2)
#define ETH_MMC_RX_INTERRUPT_RXGBOCTIS                              (0x1u<<1)
#define ETH_MMC_RX_INTERRUPT_RXGBPKTIS                              (0x1u<<0)

// MMC_TX_INTERRUPT Configuration

#define ETH_MMC_TX_INTERRUPT_TXLPITRCIS                             (0x1u<<27)
#define ETH_MMC_TX_INTERRUPT_TXLPIUSCIS                             (0x1u<<26)
#define ETH_MMC_TX_INTERRUPT_TXOSIZEGPIS                            (0x1u<<25)
#define ETH_MMC_TX_INTERRUPT_TXVLANGPIS                             (0x1u<<24)
#define ETH_MMC_TX_INTERRUPT_TXPAUSPIS                              (0x1u<<23)
#define ETH_MMC_TX_INTERRUPT_TXEXDEFPIS                             (0x1u<<22)
#define ETH_MMC_TX_INTERRUPT_TXGPKTIS                               (0x1u<<21)
#define ETH_MMC_TX_INTERRUPT_TXGOCTIS                               (0x1u<<20)
#define ETH_MMC_TX_INTERRUPT_TXCARERPIS                             (0x1u<<19)
#define ETH_MMC_TX_INTERRUPT_TXEXCOLPIS                             (0x1u<<18)
#define ETH_MMC_TX_INTERRUPT_TXLATCOLPIS                            (0x1u<<17)
#define ETH_MMC_TX_INTERRUPT_TXDEFPIS                               (0x1u<<16)
#define ETH_MMC_TX_INTERRUPT_TXMCOLGPIS                             (0x1u<<15)
#define ETH_MMC_TX_INTERRUPT_TXSCOLGPIS                             (0x1u<<14)
#define ETH_MMC_TX_INTERRUPT_TXUFLOWERPIS                           (0x1u<<13)
#define ETH_MMC_TX_INTERRUPT_TXBCGBPIS                              (0x1u<<12)
#define ETH_MMC_TX_INTERRUPT_TXMCGBPIS                              (0x1u<<11)
#define ETH_MMC_TX_INTERRUPT_TXUCGBPIS                              (0x1u<<10)
#define ETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS                     (0x1u<<9)
#define ETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS                     (0x1u<<8)
#define ETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS                      (0x1u<<7)
#define ETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS                      (0x1u<<6)
#define ETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS                       (0x1u<<5)
#define ETH_MMC_TX_INTERRUPT_TX64OCTGBPIS                           (0x1u<<4)
#define ETH_MMC_TX_INTERRUPT_TXMCGPIS                               (0x1u<<3)
#define ETH_MMC_TX_INTERRUPT_TXBCGPIS                               (0x1u<<2)
#define ETH_MMC_TX_INTERRUPT_TXGBPKTIS                              (0x1u<<1)
#define ETH_MMC_TX_INTERRUPT_TXGBOCTIS                              (0x1u<<0)

// MMC_RX_INTERRUPT_MASK Configuration

#define ETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM                        (0x1u<<27)
#define ETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM                        (0x1u<<26)
#define ETH_MMC_RX_INTERRUPT_MASK_RXCTRLPIM                         (0x1u<<25)
#define ETH_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM                       (0x1u<<24)
#define ETH_MMC_RX_INTERRUPT_MASK_RXWDOGPIM                         (0x1u<<23)
#define ETH_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM                       (0x1u<<22)
#define ETH_MMC_RX_INTERRUPT_MASK_RXFOVPIM                          (0x1u<<21)
#define ETH_MMC_RX_INTERRUPT_MASK_RXPAUSPIM                         (0x1u<<20)
#define ETH_MMC_RX_INTERRUPT_MASK_RXORANGEPIM                       (0x1u<<19)
#define ETH_MMC_RX_INTERRUPT_MASK_RXLENERPIM                        (0x1u<<18)
#define ETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM                          (0x1u<<17)
#define ETH_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM                (0x1u<<16)
#define ETH_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM                (0x1u<<15)
#define ETH_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM                 (0x1u<<14)
#define ETH_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM                 (0x1u<<13)
#define ETH_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM                  (0x1u<<12)
#define ETH_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM                      (0x1u<<11)
#define ETH_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM                       (0x1u<<10)
#define ETH_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM                       (0x1u<<9)
#define ETH_MMC_RX_INTERRUPT_MASK_RXJABERPIM                        (0x1u<<8)
#define ETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM                         (0x1u<<7)
#define ETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM                       (0x1u<<6)
#define ETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM                        (0x1u<<5)
#define ETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM                          (0x1u<<4)
#define ETH_MMC_RX_INTERRUPT_MASK_RXBCGPIM                          (0x1u<<3)
#define ETH_MMC_RX_INTERRUPT_MASK_RXGOCTIM                          (0x1u<<2)
#define ETH_MMC_RX_INTERRUPT_MASK_RXGBOCTIM                         (0x1u<<1)
#define ETH_MMC_RX_INTERRUPT_MASK_RXGBPKTIM                         (0x1u<<0)

// MMC_TX_INTERRUPT_MASK Configuration

