Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPITRCIM                        (0x1u<<27)
#define ETH_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM                        (0x1u<<26)
#define ETH_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM                       (0x1u<<25)
#define ETH_MMC_TX_INTERRUPT_MASK_TXVLANGPIM                        (0x1u<<24)
#define ETH_MMC_TX_INTERRUPT_MASK_TXPAUSPIM                         (0x1u<<23)
#define ETH_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM                        (0x1u<<22)
#define ETH_MMC_TX_INTERRUPT_MASK_TXGPKTIM                          (0x1u<<21)
#define ETH_MMC_TX_INTERRUPT_MASK_TXGOCTIM                          (0x1u<<20)
#define ETH_MMC_TX_INTERRUPT_MASK_TXCARERPIM                        (0x1u<<19)
#define ETH_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM                        (0x1u<<18)
#define ETH_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM                       (0x1u<<17)
#define ETH_MMC_TX_INTERRUPT_MASK_TXDEFPIM                          (0x1u<<16)
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM                        (0x1u<<15)
#define ETH_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM                        (0x1u<<14)
#define ETH_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM                      (0x1u<<13)
#define ETH_MMC_TX_INTERRUPT_MASK_TXBCGBPIM                         (0x1u<<12)
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCGBPIM                         (0x1u<<11)
#define ETH_MMC_TX_INTERRUPT_MASK_TXUCGBPIM                         (0x1u<<10)
#define ETH_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM                (0x1u<<9)
#define ETH_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM                (0x1u<<8)
#define ETH_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM                 (0x1u<<7)
#define ETH_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM                 (0x1u<<6)
#define ETH_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM                  (0x1u<<5)
#define ETH_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM                      (0x1u<<4)
#define ETH_MMC_TX_INTERRUPT_MASK_TXMCGPIM                          (0x1u<<3)
#define ETH_MMC_TX_INTERRUPT_MASK_TXBCGPIM                          (0x1u<<2)
#define ETH_MMC_TX_INTERRUPT_MASK_TXGBPKTIM                         (0x1u<<1)
#define ETH_MMC_TX_INTERRUPT_MASK_TXGBOCTIM                         (0x1u<<0)

// TX_OCTET_COUNT_GOOD_BAD Configuration

#define ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB                         (0xFFFFFFFFu<<0)
#define ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_0                       (0x1u<<0)

// TX_PACKET_COUNT_GOOD_BAD Configuration

#define ETH_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB                        (0xFFFFFFFFu<<0)
#define ETH_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_0                      (0x1u<<0)

// TX_BROADCAST_PACKETS_GOOD Configuration

#define ETH_TX_BROADCAST_PACKETS_GOOD_TXBCASTG                      (0xFFFFFFFFu<<0)
#define ETH_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_0                    (0x1u<<0)

// TX_MULTICAST_PACKETS_GOOD Configuration

#define ETH_TX_MULTICAST_PACKETS_GOOD_TXMCASTG                      (0xFFFFFFFFu<<0)
#define ETH_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_0                    (0x1u<<0)

// TX_64OCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB                  (0xFFFFFFFFu<<0)
#define ETH_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_0                (0x1u<<0)

// TX_64TO127OCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_TX_64TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB         (0xFFFFFFFFu<<0)
#define ETH_TX_64TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_0       (0x1u<<0)

// TX_128TO255OCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB       (0xFFFFFFFFu<<0)
#define ETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_0     (0x1u<<0)

// TX_256TO511OCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB       (0xFFFFFFFFu<<0)
#define ETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_0     (0x1u<<0)

// TX_512TO1023OCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB     (0xFFFFFFFFu<<0)
#define ETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_0   (0x1u<<0)

// TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB     (0xFFFFFFFFu<<0)
#define ETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_0   (0x1u<<0)

// TX_UNICAST_PACKETS_GOOD_BAD Configuration

#define ETH_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB                   (0xFFFFFFFFu<<0)
#define ETH_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_0                 (0x1u<<0)

// TX_MULTICAST_PACKETS_GOOD_BAD Configuration

#define ETH_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB                 (0xFFFFFFFFu<<0)
#define ETH_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_0               (0x1u<<0)

// TX_BROADCAST_PACKETS_GOOD_BAD Configuration

#define ETH_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB                 (0xFFFFFFFFu<<0)
#define ETH_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_0               (0x1u<<0)

// TX_UNDERFLOW_ERROR_PACKETS Configuration

#define ETH_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW                    (0xFFFFFFFFu<<0)
#define ETH_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_0                  (0x1u<<0)

// TX_SINGLE_COLLISION_GOOD_PACKETS Configuration

#define ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG             (0xFFFFFFFFu<<0)
#define ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_0           (0x1u<<0)

// TX_MULTIPLE_COLLISION_GOOD_PACKETS Configuration

#define ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG           (0xFFFFFFFFu<<0)
#define ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_0         (0x1u<<0)

// TX_DEFERRED_PACKETS Configuration

#define ETH_TX_DEFERRED_PACKETS_TXDEFRD                             (0xFFFFFFFFu<<0)
#define ETH_TX_DEFERRED_PACKETS_TXDEFRD_0                           (0x1u<<0)

// TX_LATE_COLLISION_PACKETS Configuration

#define ETH_TX_LATE_COLLISION_PACKETS_TXLATECOL                     (0xFFFFFFFFu<<0)
#define ETH_TX_LATE_COLLISION_PACKETS_TXLATECOL_0                   (0x1u<<0)

