Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// TX_EXCESSIVE_COLLISION_PACKETS Configuration

#define ETH_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL                 (0xFFFFFFFFu<<0)
#define ETH_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_0               (0x1u<<0)

// TX_CARRIER_ERROR_PACKETS Configuration

#define ETH_TX_CARRIER_ERROR_PACKETS_TXCARR                         (0xFFFFFFFFu<<0)
#define ETH_TX_CARRIER_ERROR_PACKETS_TXCARR_0                       (0x1u<<0)

// TX_OCTET_COUNT_GOOD Configuration

#define ETH_TX_OCTET_COUNT_GOOD_TXOCTG                              (0xFFFFFFFFu<<0)
#define ETH_TX_OCTET_COUNT_GOOD_TXOCTG_0                            (0x1u<<0)

// TX_PACKET_COUNT_GOOD Configuration

#define ETH_TX_PACKET_COUNT_GOOD_TXPKTG                             (0xFFFFFFFFu<<0)
#define ETH_TX_PACKET_COUNT_GOOD_TXPKTG_0                           (0x1u<<0)

// TX_EXCESSIVE_DEFERRAL_ERROR Configuration

#define ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF                    (0xFFFFFFFFu<<0)
#define ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_0                  (0x1u<<0)

// TX_PAUSE_PACKETS Configuration

#define ETH_TX_PAUSE_PACKETS_TXPAUSE                                (0xFFFFFFFFu<<0)
#define ETH_TX_PAUSE_PACKETS_TXPAUSE_0                              (0x1u<<0)

// TX_VLAN_PACKETS_GOOD Configuration

#define ETH_TX_VLAN_PACKETS_GOOD_TXVLANG                            (0xFFFFFFFFu<<0)
#define ETH_TX_VLAN_PACKETS_GOOD_TXVLANG_0                          (0x1u<<0)

// TX_OSIZE_PACKETS_GOOD Configuration

#define ETH_TX_OSIZE_PACKETS_GOOD_TXOSIZG                           (0xFFFFFFFFu<<0)
#define ETH_TX_OSIZE_PACKETS_GOOD_TXOSIZG_0                         (0x1u<<0)

// RX_PACKETS_COUNT_GOOD_BAD Configuration

#define ETH_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB                       (0xFFFFFFFFu<<0)
#define ETH_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_0                     (0x1u<<0)

// RX_OCTET_COUNT_GOOD_BAD Configuration

#define ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB                         (0xFFFFFFFFu<<0)
#define ETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_0                       (0x1u<<0)

// RX_OCTET_COUNT_GOOD Configuration

#define ETH_RX_OCTET_COUNT_GOOD_RXOCTG                              (0xFFFFFFFFu<<0)
#define ETH_RX_OCTET_COUNT_GOOD_RXOCTG_0                            (0x1u<<0)

// RX_BROADCAST_PACKETS_GOOD Configuration

#define ETH_RX_BROADCAST_PACKETS_GOOD_RXBCASTG                      (0xFFFFFFFFu<<0)
#define ETH_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_0                    (0x1u<<0)

// RX_MULTICAST_PACKETS_GOOD Configuration

#define ETH_RX_MULTICAST_PACKETS_GOOD_RXMCASTG                      (0xFFFFFFFFu<<0)
#define ETH_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_0                    (0x1u<<0)

// RX_CRC_ERROR_PACKETS Configuration

#define ETH_RX_CRC_ERROR_PACKETS_RXCRCERR                           (0xFFFFFFFFu<<0)
#define ETH_RX_CRC_ERROR_PACKETS_RXCRCERR_0                         (0x1u<<0)

// RX_ALIGNMENT_ERROR_PACKETS Configuration

#define ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR                    (0xFFFFFFFFu<<0)
#define ETH_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_0                  (0x1u<<0)

// RX_RUNT_ERROR_PACKETS Configuration

#define ETH_RX_RUNT_ERROR_PACKETS_RXRUNTERR                         (0xFFFFFFFFu<<0)
#define ETH_RX_RUNT_ERROR_PACKETS_RXRUNTERR_0                       (0x1u<<0)

// RX_JABBER_ERROR_PACKETS Configuration

#define ETH_RX_JABBER_ERROR_PACKETS_RXJABERR                        (0xFFFFFFFFu<<0)
#define ETH_RX_JABBER_ERROR_PACKETS_RXJABERR_0                      (0x1u<<0)

// RX_UNDERSIZE_PACKETS_GOOD Configuration

#define ETH_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG                    (0xFFFFFFFFu<<0)
#define ETH_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_0                  (0x1u<<0)

// RX_OVERSIZE_PACKETS_GOOD Configuration

#define ETH_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG                      (0xFFFFFFFFu<<0)
#define ETH_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_0                    (0x1u<<0)

// RX_64OCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB                  (0xFFFFFFFFu<<0)
#define ETH_RX_64OCTETS_PACKETS_GOOD_BAD_RX64OCTGB_0                (0x1u<<0)

// RX_65TO127OCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB         (0xFFFFFFFFu<<0)
#define ETH_RX_65TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_0       (0x1u<<0)

// RX_128TO255OCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB       (0xFFFFFFFFu<<0)
#define ETH_RX_128TO255OCTETS_PACKETS_GOOD_BAD_RX128_255OCTGB_0     (0x1u<<0)

// RX_256TO511OCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB       (0xFFFFFFFFu<<0)
#define ETH_RX_256TO511OCTETS_PACKETS_GOOD_BAD_RX256_511OCTGB_0     (0x1u<<0)

// RX_512TO1023OCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB     (0xFFFFFFFFu<<0)
#define ETH_RX_512TO1023OCTETS_PACKETS_GOOD_BAD_RX512_1023OCTGB_0   (0x1u<<0)

// RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD Configuration

#define ETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB     (0xFFFFFFFFu<<0)
#define ETH_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_RX1024_MAXOCTGB_0   (0x1u<<0)

// RX_UNICAST_PACKETS_GOOD Configuration

#define ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG                        (0xFFFFFFFFu<<0)
#define ETH_RX_UNICAST_PACKETS_GOOD_RXUCASTG_0                      (0x1u<<0)

// RX_LENGTH_ERROR_PACKETS Configuration

#define ETH_RX_LENGTH_ERROR_PACKETS_RXLENERR                        (0xFFFFFFFFu<<0)
#define ETH_RX_LENGTH_ERROR_PACKETS_RXLENERR_0                      (0x1u<<0)

// RX_OUT_OF_RANGE_PACKETS Configuration

#define ETH_RX_OUT_OF_RANGE_PACKETS_RXOUTOFRNG                      (0xFFFFFFFFu<<0)
#define ETH_RX_OUT_OF_RANGE_PACKETS_RXOUTOFRNG_0                    (0x1u<<0)

// RX_PAUSE_PACKETS Configuration

#define ETH_RX_PAUSE_PACKETS_RXPAUSEPKT                             (0xFFFFFFFFu<<0)
#define ETH_RX_PAUSE_PACKETS_RXPAUSEPKT_0                           (0x1u<<0)

// RX_FIFO_OVERFLOW_PACKETS Configuration

#define ETH_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL                     (0xFFFFFFFFu<<0)
#define ETH_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL_0                   (0x1u<<0)

// RX_VLAN_PACKETS_GOOD_BAD Configuration

#define ETH_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB                    (0xFFFFFFFFu<<0)
#define ETH_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB_0                  (0x1u<<0)

// RX_WATCHDOG_ERROR_PACKETS Configuration

