Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
#define ETH_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR                      (0xFFFFFFFFu<<0)
#define ETH_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR_0                    (0x1u<<0)

// RX_RECEIVE_ERROR Configuration

#define ETH_RX_RECEIVE_ERROR_RXRCVERR                               (0xFFFFFFFFu<<0)
#define ETH_RX_RECEIVE_ERROR_RXRCVERR_0                             (0x1u<<0)

// RX_CONTROL_PACKETS_GOOD Configuration

#define ETH_RX_CONTROL_PACKETS_GOOD_RXCTRLG                         (0xFFFFFFFFu<<0)
#define ETH_RX_CONTROL_PACKETS_GOOD_RXCTRLG_0                       (0x1u<<0)

// TX_LPI_USEC_CNTR Configuration

#define ETH_TX_LPI_USEC_CNTR_TXLPIUSC                               (0xFFFFFFFFu<<0)
#define ETH_TX_LPI_USEC_CNTR_TXLPIUSC_0                             (0x1u<<0)

// TX_LPI_TRAN_CNTR Configuration

#define ETH_TX_LPI_TRAN_CNTR_TXLPITRC                               (0xFFFFFFFFu<<0)
#define ETH_TX_LPI_TRAN_CNTR_TXLPITRC_0                             (0x1u<<0)

// RX_LPI_USEC_CNTR Configuration

#define ETH_RX_LPI_USEC_CNTR_RXLPIUSC                               (0xFFFFFFFFu<<0)
#define ETH_RX_LPI_USEC_CNTR_RXLPIUSC_0                             (0x1u<<0)

// RX_LPI_TRAN_CNTR Configuration

#define ETH_RX_LPI_TRAN_CNTR_RXLPITRC                               (0xFFFFFFFFu<<0)
#define ETH_RX_LPI_TRAN_CNTR_RXLPITRC_0                             (0x1u<<0)

// MMC_FPE_TX_ISR Configuration

#define ETH_MMC_FPE_TX_ISR_HRCIS                                    (0x1u<<1)
#define ETH_MMC_FPE_TX_ISR_FCIS                                     (0x1u<<0)

// MMC_FPE_TX_IMR Configuration

#define ETH_MMC_FPE_TX_IMR_HRCIM                                    (0x1u<<1)
#define ETH_MMC_FPE_TX_IMR_FCIM                                     (0x1u<<0)

// MMC_FPE_TX_FCR Configuration

#define ETH_MMC_FPE_TX_FCR_TXFFC                                    (0xFFFFFFFFu<<0)
#define ETH_MMC_FPE_TX_FCR_TXFFC_0                                  (0x1u<<0)

// MMC_TX_HRCR Configuration

#define ETH_MMC_TX_HRCR_TXHRC                                       (0xFFFFFFFFu<<0)
#define ETH_MMC_TX_HRCR_TXHRC_0                                     (0x1u<<0)

// MMC_FPE_RX_ISR Configuration

#define ETH_MMC_FPE_RX_ISR_FCIS                                     (0x1u<<3)
#define ETH_MMC_FPE_RX_ISR_PAOCIS                                   (0x1u<<2)
#define ETH_MMC_FPE_RX_ISR_PSECIS                                   (0x1u<<1)
#define ETH_MMC_FPE_RX_ISR_PAECIS                                   (0x1u<<0)

// MMC_FPE_RX_IMR Configuration

#define ETH_MMC_FPE_RX_IMR_FCIM                                     (0x1u<<3)
#define ETH_MMC_FPE_RX_IMR_PAOCIM                                   (0x1u<<2)
#define ETH_MMC_FPE_RX_IMR_PSECIM                                   (0x1u<<1)
#define ETH_MMC_FPE_RX_IMR_PAECIM                                   (0x1u<<0)

// RX_PACKET_ASM_ERR Configuration

#define ETH_RX_PACKET_ASM_ERR_PAEC                                  (0xFFFFFFFFu<<0)
#define ETH_RX_PACKET_ASM_ERR_PAEC_0                                (0x1u<<0)

// RX_PACKET_SMD_ERR Configuration

#define ETH_RX_PACKET_SMD_ERR_PSEC                                  (0xFFFFFFFFu<<0)
#define ETH_RX_PACKET_SMD_ERR_PSEC_0                                (0x1u<<0)

// RX_PACKET_ASM_OKR Configuration

#define ETH_RX_PACKET_ASM_OKR_PAOC                                  (0xFFFFFFFFu<<0)
#define ETH_RX_PACKET_ASM_OKR_PAOC_0                                (0x1u<<0)

// RX_FPE_FRAG_CR Configuration

#define ETH_RX_FPE_FRAG_CR_FFC                                      (0xFFFFFFFFu<<0)
#define ETH_RX_FPE_FRAG_CR_FFC_0                                    (0x1u<<0)

// MACL3L4C0R Configuration

#define ETH_MACL3L4C0R_DMCHEN0                                      (0x1u<<28)
#define ETH_MACL3L4C0R_DMCHN0                                       (0x1u<<24)
#define ETH_MACL3L4C0R_L4DPIM0                                      (0x1u<<21)
#define ETH_MACL3L4C0R_L4DPM0                                       (0x1u<<20)
#define ETH_MACL3L4C0R_L4SPIM0                                      (0x1u<<19)
#define ETH_MACL3L4C0R_L4SPM0                                       (0x1u<<18)
#define ETH_MACL3L4C0R_L4PEN0                                       (0x1u<<16)
#define ETH_MACL3L4C0R_L3HDBM0                                      (0x1Fu<<11)
#define ETH_MACL3L4C0R_L3HDBM0_0                                    (0x1u<<11)
#define ETH_MACL3L4C0R_L3HSBM0                                      (0x1Fu<<6)
#define ETH_MACL3L4C0R_L3HSBM0_0                                    (0x1u<<6)
#define ETH_MACL3L4C0R_L3DAIM0                                      (0x1u<<5)
#define ETH_MACL3L4C0R_L3DAM0                                       (0x1u<<4)
#define ETH_MACL3L4C0R_L3SAIM0                                      (0x1u<<3)
#define ETH_MACL3L4C0R_L3SAM0                                       (0x1u<<2)
#define ETH_MACL3L4C0R_L3PEN0                                       (0x1u<<0)

#define ETH_MACL3L4C0R_DMCHN0_B_0X0                                 (0x0u<<24)
#define ETH_MACL3L4C0R_DMCHN0_B_0X1                                 (0x1u<<24)
#define ETH_MACL3L4C0R_L3HDBM0_B_0X0_IPV4_PACKETS                   (0x0u<<11)
#define ETH_MACL3L4C0R_L3HDBM0_B_0X1_IPV4_PACKETS                   (0x1u<<11)
#define ETH_MACL3L4C0R_L3HSBM0_B_0X0_IPV4_PACKETS                   (0x0u<<6)
#define ETH_MACL3L4C0R_L3HSBM0_B_0X1_IPV4_PACKETS                   (0x1u<<6)

// MACL4A0R Configuration

#define ETH_MACL4A0R_L4DP0                                          (0xFFFFu<<16)
#define ETH_MACL4A0R_L4DP0_0                                        (0x1u<<16)
#define ETH_MACL4A0R_L4SP0                                          (0xFFFFu<<0)
#define ETH_MACL4A0R_L4SP0_0                                        (0x1u<<0)

// MACL3A00R Configuration

#define ETH_MACL3A00R_L3A00                                         (0xFFFFFFFFu<<0)
#define ETH_MACL3A00R_L3A00_0                                       (0x1u<<0)

// MACL3A10R Configuration

#define ETH_MACL3A10R_L3A10                                         (0xFFFFFFFFu<<0)
#define ETH_MACL3A10R_L3A10_0                                       (0x1u<<0)

// MACL3A20R Configuration

#define ETH_MACL3A20R_L3A20                                         (0xFFFFFFFFu<<0)
#define ETH_MACL3A20R_L3A20_0                                       (0x1u<<0)

