Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// MACL3A30R Configuration

#define ETH_MACL3A30R_L3A30                                         (0xFFFFFFFFu<<0)
#define ETH_MACL3A30R_L3A30_0                                       (0x1u<<0)

// MACL3L4C1R Configuration

#define ETH_MACL3L4C1R_DMCHEN1                                      (0x1u<<28)
#define ETH_MACL3L4C1R_DMCHN1                                       (0x1u<<24)
#define ETH_MACL3L4C1R_L4DPIM1                                      (0x1u<<21)
#define ETH_MACL3L4C1R_L4DPM1                                       (0x1u<<20)
#define ETH_MACL3L4C1R_L4SPIM1                                      (0x1u<<19)
#define ETH_MACL3L4C1R_L4SPM1                                       (0x1u<<18)
#define ETH_MACL3L4C1R_L4PEN1                                       (0x1u<<16)
#define ETH_MACL3L4C1R_L3HDBM1                                      (0x1Fu<<11)
#define ETH_MACL3L4C1R_L3HDBM1_0                                    (0x1u<<11)
#define ETH_MACL3L4C1R_L3HSBM1                                      (0x1Fu<<6)
#define ETH_MACL3L4C1R_L3HSBM1_0                                    (0x1u<<6)
#define ETH_MACL3L4C1R_L3DAIM1                                      (0x1u<<5)
#define ETH_MACL3L4C1R_L3DAM1                                       (0x1u<<4)
#define ETH_MACL3L4C1R_L3SAIM1                                      (0x1u<<3)
#define ETH_MACL3L4C1R_L3SAM1                                       (0x1u<<2)
#define ETH_MACL3L4C1R_L3PEN1                                       (0x1u<<0)

#define ETH_MACL3L4C1R_L3HDBM1_B_0X0_IPV4_PACKETS                   (0x0u<<11)
#define ETH_MACL3L4C1R_L3HDBM1_B_0X1_IPV4_PACKETS                   (0x1u<<11)
#define ETH_MACL3L4C1R_L3HSBM1_B_0X0_IPV4_PACKETS                   (0x0u<<6)
#define ETH_MACL3L4C1R_L3HSBM1_B_0X1_IPV4_PACKETS                   (0x1u<<6)

// MACL4A1R Configuration

#define ETH_MACL4A1R_L4DP1                                          (0xFFFFu<<16)
#define ETH_MACL4A1R_L4DP1_0                                        (0x1u<<16)
#define ETH_MACL4A1R_L4SP1                                          (0xFFFFu<<0)
#define ETH_MACL4A1R_L4SP1_0                                        (0x1u<<0)

// MACL3A01R Configuration

#define ETH_MACL3A01R_L3A01                                         (0xFFFFFFFFu<<0)
#define ETH_MACL3A01R_L3A01_0                                       (0x1u<<0)

// MACL3A11R Configuration

#define ETH_MACL3A11R_L3A11                                         (0xFFFFFFFFu<<0)
#define ETH_MACL3A11R_L3A11_0                                       (0x1u<<0)

// MACL3A21R Configuration

#define ETH_MACL3A21R_L3A21                                         (0xFFFFFFFFu<<0)
#define ETH_MACL3A21R_L3A21_0                                       (0x1u<<0)

// MACL3A31R Configuration

#define ETH_MACL3A31R_L3A31                                         (0xFFFFFFFFu<<0)
#define ETH_MACL3A31R_L3A31_0                                       (0x1u<<0)

// MAC_IACR Configuration

#define ETH_MAC_IACR_MSEL                                           (0xFu<<16)
#define ETH_MAC_IACR_MSEL_0                                         (0x1u<<16)
#define ETH_MAC_IACR_AOFF                                           (0xFFu<<8)
#define ETH_MAC_IACR_AOFF_0                                         (0x1u<<8)
#define ETH_MAC_IACR_AUTO                                           (0x1u<<5)
#define ETH_MAC_IACR_COM                                            (0x1u<<1)
#define ETH_MAC_IACR_OB                                             (0x1u<<0)

#define ETH_MAC_IACR_MSEL_B_0X0                                     (0x0u<<16)
#define ETH_MAC_IACR_MSEL_B_0X1                                     (0x1u<<16)
#define ETH_MAC_IACR_MSEL_B_0X2                                     (0x2u<<16)
#define ETH_MAC_IACR_MSEL_B_0X3                                     (0x3u<<16)
#define ETH_MAC_IACR_MSEL_B_0X4                                     (0x4u<<16)
#define ETH_MAC_IACR_MSEL_B_0X5                                     (0x5u<<16)
#define ETH_MAC_IACR_MSEL_B_0X6                                     (0x6u<<16)
#define ETH_MAC_IACR_MSEL_B_0X7                                     (0x7u<<16)
#define ETH_MAC_IACR_MSEL_B_0X8                                     (0x8u<<16)
#define ETH_MAC_IACR_MSEL_B_0X9                                     (0x9u<<16)
#define ETH_MAC_IACR_MSEL_B_0XA                                     (0xAu<<16)
#define ETH_MAC_IACR_MSEL_B_0XB                                     (0xBu<<16)
#define ETH_MAC_IACR_MSEL_B_0XC                                     (0xCu<<16)
#define ETH_MAC_IACR_MSEL_B_0XD                                     (0xDu<<16)
#define ETH_MAC_IACR_MSEL_B_0XE                                     (0xEu<<16)
#define ETH_MAC_IACR_MSEL_B_0XF                                     (0xFu<<16)
#define ETH_MAC_IACR_AOFF_B_0X0                                     (0x0u<<8)
#define ETH_MAC_IACR_AOFF_B_0X1                                     (0x1u<<8)
#define ETH_MAC_IACR_AOFF_B_0X7                                     (0x7u<<8)
#define ETH_MAC_IACR_AUTO_B_0X1                                     (0x1u<<5)
#define ETH_MAC_IACR_AUTO_B_0X0                                     (0x0u<<5)
#define ETH_MAC_IACR_COM_B_0X1                                      (0x1u<<1)
#define ETH_MAC_IACR_COM_B_0X0                                      (0x0u<<1)

// MAC_TMRQR Configuration

#define ETH_MAC_TMRQR_PFEX                                          (0x1u<<20)
#define ETH_MAC_TMRQR_TMRQ                                          (0x7u<<16)
#define ETH_MAC_TMRQR_TMRQ_0                                        (0x1u<<16)
#define ETH_MAC_TMRQR_TYP                                           (0xFFFFu<<0)
#define ETH_MAC_TMRQR_TYP_0                                         (0x1u<<0)

#define ETH_MAC_TMRQR_PFEX_B_0X0                                    (0x0u<<20)
#define ETH_MAC_TMRQR_PFEX_B_0X1                                    (0x1u<<20)

// MACTSCR Configuration

#define ETH_MACTSCR_AV8021ASMEN                                     (0x1u<<28)
#define ETH_MACTSCR_TXTSSTSM                                        (0x1u<<24)
#define ETH_MACTSCR_TSENMACADDR                                     (0x1u<<18)
#define ETH_MACTSCR_SNAPTYPSEL                                      (0x3u<<16)
#define ETH_MACTSCR_SNAPTYPSEL_0                                    (0x1u<<16)
#define ETH_MACTSCR_TSMSTRENA                                       (0x1u<<15)
#define ETH_MACTSCR_TSEVNTENA                                       (0x1u<<14)
#define ETH_MACTSCR_TSIPV4ENA                                       (0x1u<<13)
#define ETH_MACTSCR_TSIPV6ENA                                       (0x1u<<12)
#define ETH_MACTSCR_TSIPENA                                         (0x1u<<11)
#define ETH_MACTSCR_TSVER2ENA                                       (0x1u<<10)
#define ETH_MACTSCR_TSCTRLSSR                                       (0x1u<<9)
#define ETH_MACTSCR_TSENALL                                         (0x1u<<8)
#define ETH_MACTSCR_PTGE                                            (0x1u<<6)
#define ETH_MACTSCR_TSADDREG                                        (0x1u<<5)
#define ETH_MACTSCR_TSUPDT                                          (0x1u<<3)
#define ETH_MACTSCR_TSINIT                                          (0x1u<<2)
#define ETH_MACTSCR_TSCFUPDT                                        (0x1u<<1)
#define ETH_MACTSCR_TSENA                                           (0x1u<<0)

// MACSSIR Configuration

