Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// MACPPSCR_ALTERNATE1 Configuration

#define ETH_MACPPSCR_ALTERNATE1_TIMESEL                             (0x1u<<28)
#define ETH_MACPPSCR_ALTERNATE1_MCGREN1                             (0x1u<<15)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL1                         (0x3u<<13)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL1_0                       (0x1u<<13)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD1                             (0xFu<<8)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD1_0                           (0x1u<<8)
#define ETH_MACPPSCR_ALTERNATE1_MCGREN0                             (0x1u<<7)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL0                         (0x3u<<5)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL0_0                       (0x1u<<5)
#define ETH_MACPPSCR_ALTERNATE1_PPSEN0                              (0x1u<<4)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD                              (0xFu<<0)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD_0                            (0x1u<<0)

#define ETH_MACPPSCR_ALTERNATE1_MCGREN1_B_0X0                       (0x0u<<15)
#define ETH_MACPPSCR_ALTERNATE1_MCGREN1_B_0X1                       (0x1u<<15)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL1_B_0X0                   (0x0u<<13)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL1_B_0X1                   (0x1u<<13)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL1_B_0X2                   (0x2u<<13)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL1_B_0X3                   (0x3u<<13)
#define ETH_MACPPSCR_ALTERNATE1_MCGREN0_B_0X0                       (0x0u<<7)
#define ETH_MACPPSCR_ALTERNATE1_MCGREN0_B_0X1                       (0x1u<<7)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL0_B_0X0                   (0x0u<<5)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL0_B_0X1                   (0x1u<<5)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL0_B_0X2                   (0x2u<<5)
#define ETH_MACPPSCR_ALTERNATE1_TRGTMODSEL0_B_0X3                   (0x3u<<5)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD_B_0X0                        (0x0u<<0)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD_B_0X1                        (0x1u<<0)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD_B_0X2                        (0x2u<<0)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD_B_0X3                        (0x3u<<0)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD_B_0X4                        (0x4u<<0)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD_B_0X5                        (0x5u<<0)
#define ETH_MACPPSCR_ALTERNATE1_PPSCMD_B_0X6                        (0x6u<<0)

// MACPPSTTS0R Configuration

#define ETH_MACPPSTTS0R_TSTRH0                                      (0xFFFFFFFFu<<0)
#define ETH_MACPPSTTS0R_TSTRH0_0                                    (0x1u<<0)

// MACPPSTTN0R Configuration

#define ETH_MACPPSTTN0R_TRGTBUSY0                                   (0x1u<<31)
#define ETH_MACPPSTTN0R_TTSL0                                       (0x7FFFFFFFu<<0)
#define ETH_MACPPSTTN0R_TTSL0_0                                     (0x1u<<0)

// MACPPSI0R Configuration

#define ETH_MACPPSI0R_PPSINT0                                       (0xFFFFFFFFu<<0)
#define ETH_MACPPSI0R_PPSINT0_0                                     (0x1u<<0)

// MACPPSW0R Configuration

#define ETH_MACPPSW0R_PPSWIDTH0                                     (0xFFFFFFFFu<<0)
#define ETH_MACPPSW0R_PPSWIDTH0_0                                   (0x1u<<0)

// MACPPSTTS1R Configuration

#define ETH_MACPPSTTS1R_TSTRH0                                      (0xFFFFFFFFu<<0)
#define ETH_MACPPSTTS1R_TSTRH0_0                                    (0x1u<<0)

// MACPPSTTN1R Configuration

#define ETH_MACPPSTTN1R_TRGTBUSY0                                   (0x1u<<31)
#define ETH_MACPPSTTN1R_TTSL0                                       (0x7FFFFFFFu<<0)
#define ETH_MACPPSTTN1R_TTSL0_0                                     (0x1u<<0)

// MACPPSI1R Configuration

#define ETH_MACPPSI1R_PPSINT0                                       (0xFFFFFFFFu<<0)
#define ETH_MACPPSI1R_PPSINT0_0                                     (0x1u<<0)

// MACPPSW1R Configuration

#define ETH_MACPPSW1R_PPSWIDTH0                                     (0xFFFFFFFFu<<0)
#define ETH_MACPPSW1R_PPSWIDTH0_0                                   (0x1u<<0)

// MACPOCR Configuration

#define ETH_MACPOCR_DN                                              (0xFFu<<8)
#define ETH_MACPOCR_DN_0                                            (0x1u<<8)
#define ETH_MACPOCR_PDRDIS                                          (0x1u<<7)
#define ETH_MACPOCR_DRRDIS                                          (0x1u<<6)
#define ETH_MACPOCR_APDREQTRIG                                      (0x1u<<5)
#define ETH_MACPOCR_ASYNCTRIG                                       (0x1u<<4)
#define ETH_MACPOCR_APDREQEN                                        (0x1u<<2)
#define ETH_MACPOCR_ASYNCEN                                         (0x1u<<1)
#define ETH_MACPOCR_PTOEN                                           (0x1u<<0)

// MACSPI0R Configuration

#define ETH_MACSPI0R_SPI0                                           (0xFFFFFFFFu<<0)
#define ETH_MACSPI0R_SPI0_0                                         (0x1u<<0)

// MACSPI1R Configuration

#define ETH_MACSPI1R_SPI1                                           (0xFFFFFFFFu<<0)
#define ETH_MACSPI1R_SPI1_0                                         (0x1u<<0)

// MACSPI2R Configuration

#define ETH_MACSPI2R_SPI2                                           (0xFFFFu<<0)
#define ETH_MACSPI2R_SPI2_0                                         (0x1u<<0)

// MACLMIR Configuration

#define ETH_MACLMIR_LMPDRI                                          (0xFFu<<24)
#define ETH_MACLMIR_LMPDRI_0                                        (0x1u<<24)
#define ETH_MACLMIR_DRSYNCR                                         (0x7u<<8)
#define ETH_MACLMIR_DRSYNCR_0                                       (0x1u<<8)
#define ETH_MACLMIR_LSI                                             (0xFFu<<0)
#define ETH_MACLMIR_LSI_0                                           (0x1u<<0)

#define ETH_MACLMIR_DRSYNCR_B_0X0                                   (0x0u<<8)
#define ETH_MACLMIR_DRSYNCR_B_0X1                                   (0x1u<<8)

// MTLOMR Configuration

#define ETH_MTLOMR_CNTCLR                                           (0x1u<<9)
#define ETH_MTLOMR_CNTPRST                                          (0x1u<<8)
#define ETH_MTLOMR_SCHALG                                           (0x3u<<5)
#define ETH_MTLOMR_SCHALG_0                                         (0x1u<<5)
#define ETH_MTLOMR_RAA                                              (0x1u<<2)
#define ETH_MTLOMR_DTXSTS                                           (0x1u<<1)

#define ETH_MTLOMR_SCHALG_B_0X0                                     (0x0u<<5)
#define ETH_MTLOMR_SCHALG_B_0X3                                     (0x3u<<5)
#define ETH_MTLOMR_RAA_B_0X0                                        (0x0u<<2)
#define ETH_MTLOMR_RAA_B_0X1                                        (0x1u<<2)

// MTLISR Configuration

