Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
#define ETH_MTLISR_ESTIS                                            (0x1u<<18)
#define ETH_MTLISR_Q3IS                                             (0x1u<<3)
#define ETH_MTLISR_Q2IS                                             (0x1u<<2)
#define ETH_MTLISR_Q1IS                                             (0x1u<<1)
#define ETH_MTLISR_Q0IS                                             (0x1u<<0)

// MTLRXQDMAMR Configuration

#define ETH_MTLRXQDMAMR_Q1DDMACH                                    (0x1u<<12)
#define ETH_MTLRXQDMAMR_Q1MDMACH                                    (0x1u<<8)
#define ETH_MTLRXQDMAMR_Q0DDMACH                                    (0x1u<<4)
#define ETH_MTLRXQDMAMR_Q0MDMACH                                    (0x1u<<0)

#define ETH_MTLRXQDMAMR_Q1MDMACH_B_0X0                              (0x0u<<8)
#define ETH_MTLRXQDMAMR_Q1MDMACH_B_0X1                              (0x1u<<8)
#define ETH_MTLRXQDMAMR_Q0MDMACH_B_0X0                              (0x0u<<0)
#define ETH_MTLRXQDMAMR_Q0MDMACH_B_0X1                              (0x1u<<0)

// MTLTBSCR Configuration

#define ETH_MTLTBSCR_LEOS                                           (0xFFFFFFu<<8)
#define ETH_MTLTBSCR_LEOS_0                                         (0x1u<<8)
#define ETH_MTLTBSCR_LEGOS                                          (0x7u<<4)
#define ETH_MTLTBSCR_LEGOS_0                                        (0x1u<<4)
#define ETH_MTLTBSCR_LEOV                                           (0x1u<<1)
#define ETH_MTLTBSCR_ESTM                                           (0x1u<<0)

#define ETH_MTLTBSCR_LEOV_B_0X0                                     (0x0u<<1)
#define ETH_MTLTBSCR_LEOV_B_0X1                                     (0x1u<<1)
#define ETH_MTLTBSCR_ESTM_B_0X0                                     (0x0u<<0)
#define ETH_MTLTBSCR_ESTM_B_0X1                                     (0x1u<<0)

// MTLESTCR Configuration

#define ETH_MTLESTCR_PTOV                                           (0xFFu<<24)
#define ETH_MTLESTCR_PTOV_0                                         (0x1u<<24)
#define ETH_MTLESTCR_CTOV                                           (0xFFFu<<12)
#define ETH_MTLESTCR_CTOV_0                                         (0x1u<<12)
#define ETH_MTLESTCR_TILS                                           (0x7u<<8)
#define ETH_MTLESTCR_TILS_0                                         (0x1u<<8)
#define ETH_MTLESTCR_LCSE                                           (0x3u<<6)
#define ETH_MTLESTCR_LCSE_0                                         (0x1u<<6)
#define ETH_MTLESTCR_DFBS                                           (0x1u<<5)
#define ETH_MTLESTCR_DDBF                                           (0x1u<<4)
#define ETH_MTLESTCR_SSWL                                           (0x1u<<1)
#define ETH_MTLESTCR_EEST                                           (0x1u<<0)

#define ETH_MTLESTCR_TILS_B_0X0                                     (0x0u<<8)
#define ETH_MTLESTCR_TILS_B_0X1                                     (0x1u<<8)
#define ETH_MTLESTCR_TILS_B_0X2                                     (0x2u<<8)
#define ETH_MTLESTCR_TILS_B_0X4                                     (0x4u<<8)
#define ETH_MTLESTCR_LCSE_B_0X0                                     (0x0u<<6)
#define ETH_MTLESTCR_LCSE_B_0X1                                     (0x1u<<6)
#define ETH_MTLESTCR_LCSE_B_0X2                                     (0x2u<<6)
#define ETH_MTLESTCR_LCSE_B_0X3                                     (0x3u<<6)
#define ETH_MTLESTCR_DFBS_B_0X0                                     (0x0u<<5)
#define ETH_MTLESTCR_DFBS_B_0X1                                     (0x1u<<5)
#define ETH_MTLESTCR_DDBF_B_0X0                                     (0x0u<<4)
#define ETH_MTLESTCR_DDBF_B_0X1                                     (0x1u<<4)
#define ETH_MTLESTCR_EEST_B_0X0                                     (0x0u<<0)
#define ETH_MTLESTCR_EEST_B_0X1                                     (0x1u<<0)

// MTLESTECR Configuration

#define ETH_MTLESTECR_OVHD                                          (0x3Fu<<0)
#define ETH_MTLESTECR_OVHD_0                                        (0x1u<<0)

// MTLESTSR Configuration

#define ETH_MTLESTSR_CGSN                                           (0xFu<<16)
#define ETH_MTLESTSR_CGSN_0                                         (0x1u<<16)
#define ETH_MTLESTSR_BTRL                                           (0xFFu<<8)
#define ETH_MTLESTSR_BTRL_0                                         (0x1u<<8)
#define ETH_MTLESTSR_SWOL                                           (0x1u<<7)
#define ETH_MTLESTSR_CGCE                                           (0x1u<<4)
#define ETH_MTLESTSR_HLBS                                           (0x1u<<3)
#define ETH_MTLESTSR_HLBF                                           (0x1u<<2)
#define ETH_MTLESTSR_BTRE                                           (0x1u<<1)
#define ETH_MTLESTSR_SWLC                                           (0x1u<<0)

#define ETH_MTLESTSR_SWOL_B_0X0                                     (0x0u<<7)
#define ETH_MTLESTSR_SWOL_B_0X1                                     (0x1u<<7)
#define ETH_MTLESTSR_CGCE_B_0X0                                     (0x0u<<4)
#define ETH_MTLESTSR_CGCE_B_0X1                                     (0x1u<<4)
#define ETH_MTLESTSR_HLBS_B_0X0                                     (0x0u<<3)
#define ETH_MTLESTSR_HLBS_B_0X1                                     (0x1u<<3)
#define ETH_MTLESTSR_BTRE_B_0X0                                     (0x0u<<1)
#define ETH_MTLESTSR_BTRE_B_0X1                                     (0x1u<<1)
#define ETH_MTLESTSR_SWLC_B_0X0                                     (0x0u<<0)
#define ETH_MTLESTSR_SWLC_B_0X1                                     (0x1u<<0)

// MTLESTSCHER Configuration

#define ETH_MTLESTSCHER_SEQN                                        (0xFu<<0)
#define ETH_MTLESTSCHER_SEQN_0                                      (0x1u<<0)

// MTLESTFSER Configuration

#define ETH_MTLESTFSER_FEQN                                         (0xFu<<0)
#define ETH_MTLESTFSER_FEQN_0                                       (0x1u<<0)

// MTLESTFSCR Configuration

#define ETH_MTLESTFSCR_HBFQ                                         (0x3u<<16)
#define ETH_MTLESTFSCR_HBFQ_0                                       (0x1u<<16)
#define ETH_MTLESTFSCR_HBFS                                         (0x7FFFu<<0)
#define ETH_MTLESTFSCR_HBFS_0                                       (0x1u<<0)

// MTLESTIER Configuration

