Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// MTLTXQ0QWR Configuration

#define ETH_MTLTXQ0QWR_ISCQW                                        (0x3FFFu<<0)
#define ETH_MTLTXQ0QWR_ISCQW_0                                      (0x1u<<0)

// MTLQ0ICSR Configuration

#define ETH_MTLQ0ICSR_RXOIE                                         (0x1u<<24)
#define ETH_MTLQ0ICSR_RXOVFIS                                       (0x1u<<16)
#define ETH_MTLQ0ICSR_ABPSIE                                        (0x1u<<9)
#define ETH_MTLQ0ICSR_TXUIE                                         (0x1u<<8)
#define ETH_MTLQ0ICSR_ABPSIS                                        (0x1u<<1)
#define ETH_MTLQ0ICSR_TXUNFIS                                       (0x1u<<0)

// MTLRXQ0OMR Configuration

#define ETH_MTLRXQ0OMR_RQS                                          (0xFu<<20)
#define ETH_MTLRXQ0OMR_RQS_0                                        (0x1u<<20)
#define ETH_MTLRXQ0OMR_RFD                                          (0x7u<<14)
#define ETH_MTLRXQ0OMR_RFD_0                                        (0x1u<<14)
#define ETH_MTLRXQ0OMR_RFA                                          (0x7u<<8)
#define ETH_MTLRXQ0OMR_RFA_0                                        (0x1u<<8)
#define ETH_MTLRXQ0OMR_EHFC                                         (0x1u<<7)
#define ETH_MTLRXQ0OMR_DIS_TCP_EF                                   (0x1u<<6)
#define ETH_MTLRXQ0OMR_RSF                                          (0x1u<<5)
#define ETH_MTLRXQ0OMR_FEP                                          (0x1u<<4)
#define ETH_MTLRXQ0OMR_FUP                                          (0x1u<<3)
#define ETH_MTLRXQ0OMR_RTC                                          (0x3u<<0)
#define ETH_MTLRXQ0OMR_RTC_0                                        (0x1u<<0)

#define ETH_MTLRXQ0OMR_RFD_B_0X0                                    (0x0u<<14)
#define ETH_MTLRXQ0OMR_RFD_B_0X1                                    (0x1u<<14)
#define ETH_MTLRXQ0OMR_RTC_B_0X0                                    (0x0u<<0)
#define ETH_MTLRXQ0OMR_RTC_B_0X1                                    (0x1u<<0)
#define ETH_MTLRXQ0OMR_RTC_B_0X2                                    (0x2u<<0)
#define ETH_MTLRXQ0OMR_RTC_B_0X3                                    (0x3u<<0)

// MTLRXQ0MPOCR Configuration

#define ETH_MTLRXQ0MPOCR_MISCNTOVF                                  (0x1u<<27)
#define ETH_MTLRXQ0MPOCR_MISPKTCNT                                  (0x7FFu<<16)
#define ETH_MTLRXQ0MPOCR_MISPKTCNT_0                                (0x1u<<16)
#define ETH_MTLRXQ0MPOCR_OVFCNTOVF                                  (0x1u<<11)
#define ETH_MTLRXQ0MPOCR_OVFPKTCNT                                  (0x7FFu<<0)
#define ETH_MTLRXQ0MPOCR_OVFPKTCNT_0                                (0x1u<<0)

// MTLRXQ0DR Configuration

#define ETH_MTLRXQ0DR_PRXQ                                          (0x3FFFu<<16)
#define ETH_MTLRXQ0DR_PRXQ_0                                        (0x1u<<16)
#define ETH_MTLRXQ0DR_RXQSTS                                        (0x3u<<4)
#define ETH_MTLRXQ0DR_RXQSTS_0                                      (0x1u<<4)
#define ETH_MTLRXQ0DR_RRCSTS                                        (0x3u<<1)
#define ETH_MTLRXQ0DR_RRCSTS_0                                      (0x1u<<1)
#define ETH_MTLRXQ0DR_RWCSTS                                        (0x1u<<0)

#define ETH_MTLRXQ0DR_RXQSTS_B_0X0                                  (0x0u<<4)
#define ETH_MTLRXQ0DR_RXQSTS_B_0X1                                  (0x1u<<4)
#define ETH_MTLRXQ0DR_RXQSTS_B_0X2                                  (0x2u<<4)
#define ETH_MTLRXQ0DR_RXQSTS_B_0X3                                  (0x3u<<4)
#define ETH_MTLRXQ0DR_RRCSTS_B_0X0                                  (0x0u<<1)
#define ETH_MTLRXQ0DR_RRCSTS_B_0X1                                  (0x1u<<1)
#define ETH_MTLRXQ0DR_RRCSTS_B_0X2                                  (0x2u<<1)
#define ETH_MTLRXQ0DR_RRCSTS_B_0X3                                  (0x3u<<1)

// MTLRXQ0CR Configuration

#define ETH_MTLRXQ0CR_RXQ_FRM_ARBIT                                 (0x1u<<3)
#define ETH_MTLRXQ0CR_RXQ_WEGT                                      (0x7u<<0)
#define ETH_MTLRXQ0CR_RXQ_WEGT_0                                    (0x1u<<0)

// MTLTXQ1OMR Configuration

#define ETH_MTLTXQ1OMR_TQS                                          (0x1Fu<<16)
#define ETH_MTLTXQ1OMR_TQS_0                                        (0x1u<<16)
#define ETH_MTLTXQ1OMR_TTC                                          (0x7u<<4)
#define ETH_MTLTXQ1OMR_TTC_0                                        (0x1u<<4)
#define ETH_MTLTXQ1OMR_TXQEN                                        (0x3u<<2)
#define ETH_MTLTXQ1OMR_TXQEN_0                                      (0x1u<<2)
#define ETH_MTLTXQ1OMR_TSF                                          (0x1u<<1)
#define ETH_MTLTXQ1OMR_FTQ                                          (0x1u<<0)

#define ETH_MTLTXQ1OMR_TTC_B_0X0                                    (0x0u<<4)
#define ETH_MTLTXQ1OMR_TTC_B_0X1                                    (0x1u<<4)
#define ETH_MTLTXQ1OMR_TTC_B_0X2                                    (0x2u<<4)
#define ETH_MTLTXQ1OMR_TTC_B_0X3                                    (0x3u<<4)
#define ETH_MTLTXQ1OMR_TTC_B_0X4                                    (0x4u<<4)
#define ETH_MTLTXQ1OMR_TTC_B_0X5                                    (0x5u<<4)
#define ETH_MTLTXQ1OMR_TTC_B_0X6                                    (0x6u<<4)
#define ETH_MTLTXQ1OMR_TTC_B_0X7                                    (0x7u<<4)
#define ETH_MTLTXQ1OMR_TXQEN_B_0X0                                  (0x0u<<2)
#define ETH_MTLTXQ1OMR_TXQEN_B_0X1                                  (0x1u<<2)
#define ETH_MTLTXQ1OMR_TXQEN_B_0X2                                  (0x2u<<2)

// MTLTXQ1UR Configuration

#define ETH_MTLTXQ1UR_UFCNTOVF                                      (0x1u<<11)
#define ETH_MTLTXQ1UR_UFFRMCNT                                      (0x7FFu<<0)
#define ETH_MTLTXQ1UR_UFFRMCNT_0                                    (0x1u<<0)

// MTLTXQ1DR Configuration

#define ETH_MTLTXQ1DR_STXSTSF                                       (0x7u<<20)
#define ETH_MTLTXQ1DR_STXSTSF_0                                     (0x1u<<20)
#define ETH_MTLTXQ1DR_PTXQ                                          (0x7u<<16)
#define ETH_MTLTXQ1DR_PTXQ_0                                        (0x1u<<16)
#define ETH_MTLTXQ1DR_TXSTSFSTS                                     (0x1u<<5)
#define ETH_MTLTXQ1DR_TXQSTS                                        (0x1u<<4)
#define ETH_MTLTXQ1DR_TWCSTS                                        (0x1u<<3)
#define ETH_MTLTXQ1DR_TRCSTS                                        (0x3u<<1)
#define ETH_MTLTXQ1DR_TRCSTS_0                                      (0x1u<<1)
#define ETH_MTLTXQ1DR_TXQPAUSED                                     (0x1u<<0)

#define ETH_MTLTXQ1DR_TRCSTS_B_0X0                                  (0x0u<<1)
#define ETH_MTLTXQ1DR_TRCSTS_B_0X1                                  (0x1u<<1)
#define ETH_MTLTXQ1DR_TRCSTS_B_0X2                                  (0x2u<<1)
#define ETH_MTLTXQ1DR_TRCSTS_B_0X3                                  (0x3u<<1)

// MTLTXQ1ECR Configuration

#define ETH_MTLTXQ1ECR_SLC                                          (0x7u<<4)
#define ETH_MTLTXQ1ECR_SLC_0                                        (0x1u<<4)
#define ETH_MTLTXQ1ECR_CC                                           (0x1u<<3)
#define ETH_MTLTXQ1ECR_AVALG                                        (0x1u<<2)

#define ETH_MTLTXQ1ECR_SLC_B_0X0                                    (0x0u<<4)
#define ETH_MTLTXQ1ECR_SLC_B_0X1                                    (0x1u<<4)
#define ETH_MTLTXQ1ECR_SLC_B_0X2                                    (0x2u<<4)
#define ETH_MTLTXQ1ECR_SLC_B_0X3                                    (0x3u<<4)
#define ETH_MTLTXQ1ECR_SLC_B_0X4                                    (0x4u<<4)

