Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
#define ETH_MTLTXQ2UR_UFCNTOVF                                      (0x1u<<11)
#define ETH_MTLTXQ2UR_UFFRMCNT                                      (0x7FFu<<0)
#define ETH_MTLTXQ2UR_UFFRMCNT_0                                    (0x1u<<0)

// MTLTXQ2DR Configuration

#define ETH_MTLTXQ2DR_STXSTSF                                       (0x7u<<20)
#define ETH_MTLTXQ2DR_STXSTSF_0                                     (0x1u<<20)
#define ETH_MTLTXQ2DR_PTXQ                                          (0x7u<<16)
#define ETH_MTLTXQ2DR_PTXQ_0                                        (0x1u<<16)
#define ETH_MTLTXQ2DR_TXSTSFSTS                                     (0x1u<<5)
#define ETH_MTLTXQ2DR_TXQSTS                                        (0x1u<<4)
#define ETH_MTLTXQ2DR_TWCSTS                                        (0x1u<<3)
#define ETH_MTLTXQ2DR_TRCSTS                                        (0x3u<<1)
#define ETH_MTLTXQ2DR_TRCSTS_0                                      (0x1u<<1)
#define ETH_MTLTXQ2DR_TXQPAUSED                                     (0x1u<<0)

#define ETH_MTLTXQ2DR_TRCSTS_B_0X0                                  (0x0u<<1)
#define ETH_MTLTXQ2DR_TRCSTS_B_0X1                                  (0x1u<<1)
#define ETH_MTLTXQ2DR_TRCSTS_B_0X2                                  (0x2u<<1)
#define ETH_MTLTXQ2DR_TRCSTS_B_0X3                                  (0x3u<<1)

// MTLTXQ2ECR Configuration

#define ETH_MTLTXQ2ECR_SLC                                          (0x7u<<4)
#define ETH_MTLTXQ2ECR_SLC_0                                        (0x1u<<4)
#define ETH_MTLTXQ2ECR_CC                                           (0x1u<<3)
#define ETH_MTLTXQ2ECR_AVALG                                        (0x1u<<2)

#define ETH_MTLTXQ2ECR_SLC_B_0X0                                    (0x0u<<4)
#define ETH_MTLTXQ2ECR_SLC_B_0X1                                    (0x1u<<4)
#define ETH_MTLTXQ2ECR_SLC_B_0X2                                    (0x2u<<4)
#define ETH_MTLTXQ2ECR_SLC_B_0X3                                    (0x3u<<4)
#define ETH_MTLTXQ2ECR_SLC_B_0X4                                    (0x4u<<4)

// MTLTXQ2ESR Configuration

#define ETH_MTLTXQ2ESR_ABS                                          (0xFFFFFFu<<0)
#define ETH_MTLTXQ2ESR_ABS_0                                        (0x1u<<0)

// MTLTXQ2QWR Configuration

#define ETH_MTLTXQ2QWR_ISCQW                                        (0x3FFFu<<0)
#define ETH_MTLTXQ2QWR_ISCQW_0                                      (0x1u<<0)

// MTLTXQ2SSCR Configuration

#define ETH_MTLTXQ2SSCR_SSC                                         (0x3FFFu<<0)
#define ETH_MTLTXQ2SSCR_SSC_0                                       (0x1u<<0)

// MTLTXQ2HCR Configuration

#define ETH_MTLTXQ2HCR_HC                                           (0x1FFFFFFFu<<0)
#define ETH_MTLTXQ2HCR_HC_0                                         (0x1u<<0)

// MTLTXQ2LCR Configuration

#define ETH_MTLTXQ2LCR_LC                                           (0x1FFFFFFFu<<0)
#define ETH_MTLTXQ2LCR_LC_0                                         (0x1u<<0)

// MTLQ2ICSR Configuration

#define ETH_MTLQ2ICSR_RXOIE                                         (0x1u<<24)
#define ETH_MTLQ2ICSR_RXOVFIS                                       (0x1u<<16)
#define ETH_MTLQ2ICSR_ABPSIE                                        (0x1u<<9)
#define ETH_MTLQ2ICSR_TXUIE                                         (0x1u<<8)
#define ETH_MTLQ2ICSR_ABPSIS                                        (0x1u<<1)
#define ETH_MTLQ2ICSR_TXUNFIS                                       (0x1u<<0)

// MTLTXQ3OMR Configuration

#define ETH_MTLTXQ3OMR_TQS                                          (0x1Fu<<16)
#define ETH_MTLTXQ3OMR_TQS_0                                        (0x1u<<16)
#define ETH_MTLTXQ3OMR_TTC                                          (0x7u<<4)
#define ETH_MTLTXQ3OMR_TTC_0                                        (0x1u<<4)
#define ETH_MTLTXQ3OMR_TXQEN                                        (0x3u<<2)
#define ETH_MTLTXQ3OMR_TXQEN_0                                      (0x1u<<2)
#define ETH_MTLTXQ3OMR_TSF                                          (0x1u<<1)
#define ETH_MTLTXQ3OMR_FTQ                                          (0x1u<<0)

#define ETH_MTLTXQ3OMR_TTC_B_0X0                                    (0x0u<<4)
#define ETH_MTLTXQ3OMR_TTC_B_0X1                                    (0x1u<<4)
#define ETH_MTLTXQ3OMR_TTC_B_0X2                                    (0x2u<<4)
#define ETH_MTLTXQ3OMR_TTC_B_0X3                                    (0x3u<<4)
#define ETH_MTLTXQ3OMR_TTC_B_0X4                                    (0x4u<<4)
#define ETH_MTLTXQ3OMR_TTC_B_0X5                                    (0x5u<<4)
#define ETH_MTLTXQ3OMR_TTC_B_0X6                                    (0x6u<<4)
#define ETH_MTLTXQ3OMR_TTC_B_0X7                                    (0x7u<<4)
#define ETH_MTLTXQ3OMR_TXQEN_B_0X0                                  (0x0u<<2)
#define ETH_MTLTXQ3OMR_TXQEN_B_0X1                                  (0x1u<<2)
#define ETH_MTLTXQ3OMR_TXQEN_B_0X2                                  (0x2u<<2)

// MTLTXQ3UR Configuration

#define ETH_MTLTXQ3UR_UFCNTOVF                                      (0x1u<<11)
#define ETH_MTLTXQ3UR_UFFRMCNT                                      (0x7FFu<<0)
#define ETH_MTLTXQ3UR_UFFRMCNT_0                                    (0x1u<<0)

// MTLTXQ3DR Configuration

#define ETH_MTLTXQ3DR_STXSTSF                                       (0x7u<<20)
#define ETH_MTLTXQ3DR_STXSTSF_0                                     (0x1u<<20)
#define ETH_MTLTXQ3DR_PTXQ                                          (0x7u<<16)
#define ETH_MTLTXQ3DR_PTXQ_0                                        (0x1u<<16)
#define ETH_MTLTXQ3DR_TXSTSFSTS                                     (0x1u<<5)
#define ETH_MTLTXQ3DR_TXQSTS                                        (0x1u<<4)
#define ETH_MTLTXQ3DR_TWCSTS                                        (0x1u<<3)
#define ETH_MTLTXQ3DR_TRCSTS                                        (0x3u<<1)
#define ETH_MTLTXQ3DR_TRCSTS_0                                      (0x1u<<1)
#define ETH_MTLTXQ3DR_TXQPAUSED                                     (0x1u<<0)

