Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
#define ETH_MTLTXQ3DR_TRCSTS_B_0X0                                  (0x0u<<1)
#define ETH_MTLTXQ3DR_TRCSTS_B_0X1                                  (0x1u<<1)
#define ETH_MTLTXQ3DR_TRCSTS_B_0X2                                  (0x2u<<1)
#define ETH_MTLTXQ3DR_TRCSTS_B_0X3                                  (0x3u<<1)

// MTLTXQ3ECR Configuration

#define ETH_MTLTXQ3ECR_SLC                                          (0x7u<<4)
#define ETH_MTLTXQ3ECR_SLC_0                                        (0x1u<<4)
#define ETH_MTLTXQ3ECR_CC                                           (0x1u<<3)
#define ETH_MTLTXQ3ECR_AVALG                                        (0x1u<<2)

#define ETH_MTLTXQ3ECR_SLC_B_0X0                                    (0x0u<<4)
#define ETH_MTLTXQ3ECR_SLC_B_0X1                                    (0x1u<<4)
#define ETH_MTLTXQ3ECR_SLC_B_0X2                                    (0x2u<<4)
#define ETH_MTLTXQ3ECR_SLC_B_0X3                                    (0x3u<<4)
#define ETH_MTLTXQ3ECR_SLC_B_0X4                                    (0x4u<<4)

// MTLTXQ3ESR Configuration

#define ETH_MTLTXQ3ESR_ABS                                          (0xFFFFFFu<<0)
#define ETH_MTLTXQ3ESR_ABS_0                                        (0x1u<<0)

// MTLTXQ3QWR Configuration

#define ETH_MTLTXQ3QWR_ISCQW                                        (0x3FFFu<<0)
#define ETH_MTLTXQ3QWR_ISCQW_0                                      (0x1u<<0)

// MTLTXQ3SSCR Configuration

#define ETH_MTLTXQ3SSCR_SSC                                         (0x3FFFu<<0)
#define ETH_MTLTXQ3SSCR_SSC_0                                       (0x1u<<0)

// MTLTXQ3HCR Configuration

#define ETH_MTLTXQ3HCR_HC                                           (0x1FFFFFFFu<<0)
#define ETH_MTLTXQ3HCR_HC_0                                         (0x1u<<0)

// MTLTXQ3LCR Configuration

#define ETH_MTLTXQ3LCR_LC                                           (0x1FFFFFFFu<<0)
#define ETH_MTLTXQ3LCR_LC_0                                         (0x1u<<0)

// MTLQ3ICSR Configuration

#define ETH_MTLQ3ICSR_RXOIE                                         (0x1u<<24)
#define ETH_MTLQ3ICSR_RXOVFIS                                       (0x1u<<16)
#define ETH_MTLQ3ICSR_ABPSIE                                        (0x1u<<9)
#define ETH_MTLQ3ICSR_TXUIE                                         (0x1u<<8)
#define ETH_MTLQ3ICSR_ABPSIS                                        (0x1u<<1)
#define ETH_MTLQ3ICSR_TXUNFIS                                       (0x1u<<0)

// DMAMR Configuration

#define ETH_DMAMR_INTM                                              (0x3u<<16)
#define ETH_DMAMR_INTM_0                                            (0x1u<<16)
#define ETH_DMAMR_TXPR                                              (0x1u<<11)
#define ETH_DMAMR_DSPW                                              (0x1u<<8)
#define ETH_DMAMR_TAA2                                              (0x1u<<4)
#define ETH_DMAMR_TAA1                                              (0x1u<<3)
#define ETH_DMAMR_TAA0                                              (0x1u<<2)
#define ETH_DMAMR_SWR                                               (0x1u<<0)

#define ETH_DMAMR_DSPW_B_0X0                                        (0x0u<<8)
#define ETH_DMAMR_DSPW_B_0X1                                        (0x1u<<8)
#define ETH_DMAMR_TAA2_B_0X0                                        (0x0u<<4)
#define ETH_DMAMR_TAA2_B_0X1                                        (0x1u<<4)
#define ETH_DMAMR_TAA1_B_0X0                                        (0x0u<<3)
#define ETH_DMAMR_TAA1_B_0X1                                        (0x1u<<3)
#define ETH_DMAMR_TAA0_B_0X0                                        (0x0u<<2)
#define ETH_DMAMR_TAA0_B_0X1                                        (0x1u<<2)

// DMASBMR Configuration

#define ETH_DMASBMR_EN_LPI                                          (0x1u<<31)
#define ETH_DMASBMR_LPI_XIT_PKT                                     (0x1u<<30)
#define ETH_DMASBMR_WR_OSR_LMT                                      (0x3u<<24)
#define ETH_DMASBMR_WR_OSR_LMT_0                                    (0x1u<<24)
#define ETH_DMASBMR_RD_OSR_LMT                                      (0x3u<<16)
#define ETH_DMASBMR_RD_OSR_LMT_0                                    (0x1u<<16)
#define ETH_DMASBMR_ONEKBBE                                         (0x1u<<13)
#define ETH_DMASBMR_AAL                                             (0x1u<<12)
#define ETH_DMASBMR_AALE                                            (0x1u<<10)
#define ETH_DMASBMR_BLEN256                                         (0x1u<<7)
#define ETH_DMASBMR_BLEN128                                         (0x1u<<6)
#define ETH_DMASBMR_BLEN64                                          (0x1u<<5)
#define ETH_DMASBMR_BLEN32                                          (0x1u<<4)
#define ETH_DMASBMR_BLEN16                                          (0x1u<<3)
#define ETH_DMASBMR_BLEN8                                           (0x1u<<2)
#define ETH_DMASBMR_BLEN4                                           (0x1u<<1)
#define ETH_DMASBMR_FB                                              (0x1u<<0)

// DMAISR Configuration

#define ETH_DMAISR_MACIS                                            (0x1u<<17)
#define ETH_DMAISR_MTLIS                                            (0x1u<<16)
#define ETH_DMAISR_DC3IS                                            (0x1u<<3)
#define ETH_DMAISR_DC2IS                                            (0x1u<<2)
#define ETH_DMAISR_DC1IS                                            (0x1u<<1)
#define ETH_DMAISR_DC0IS                                            (0x1u<<0)

// DMADS1R Configuration

#define ETH_DMADS1R_TPS2                                            (0xFu<<28)
#define ETH_DMADS1R_TPS2_0                                          (0x1u<<28)
#define ETH_DMADS1R_TPS1                                            (0xFu<<20)
#define ETH_DMADS1R_TPS1_0                                          (0x1u<<20)
#define ETH_DMADS1R_RPS1                                            (0xFu<<16)
#define ETH_DMADS1R_RPS1_0                                          (0x1u<<16)
#define ETH_DMADS1R_TPS0                                            (0xFu<<12)
#define ETH_DMADS1R_TPS0_0                                          (0x1u<<12)
#define ETH_DMADS1R_RPS0                                            (0xFu<<8)
#define ETH_DMADS1R_RPS0_0                                          (0x1u<<8)
#define ETH_DMADS1R_AXRHSTS                                         (0x1u<<1)
#define ETH_DMADS1R_AXWHSTS                                         (0x1u<<0)

#define ETH_DMADS1R_TPS0_B_0X0                                      (0x0u<<12)
#define ETH_DMADS1R_TPS0_B_0X1                                      (0x1u<<12)
#define ETH_DMADS1R_TPS0_B_0X2                                      (0x2u<<12)
#define ETH_DMADS1R_TPS0_B_0X3                                      (0x3u<<12)
#define ETH_DMADS1R_TPS0_B_0X4                                      (0x4u<<12)
#define ETH_DMADS1R_TPS0_B_0X5                                      (0x5u<<12)
#define ETH_DMADS1R_TPS0_B_0X6                                      (0x6u<<12)
#define ETH_DMADS1R_TPS0_B_0X7                                      (0x7u<<12)
#define ETH_DMADS1R_RPS0_B_0X0                                      (0x0u<<8)
#define ETH_DMADS1R_RPS0_B_0X1                                      (0x1u<<8)
#define ETH_DMADS1R_RPS0_B_0X2                                      (0x2u<<8)
#define ETH_DMADS1R_RPS0_B_0X3                                      (0x3u<<8)
#define ETH_DMADS1R_RPS0_B_0X4                                      (0x4u<<8)
#define ETH_DMADS1R_RPS0_B_0X5                                      (0x5u<<8)
#define ETH_DMADS1R_RPS0_B_0X6                                      (0x6u<<8)
#define ETH_DMADS1R_RPS0_B_0X7                                      (0x7u<<8)

// DMADS2R Configuration

