Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
#define ETH_DMADS2R_TPS3                                            (0xFu<<4)
#define ETH_DMADS2R_TPS3_0                                          (0x1u<<4)

// DMAA4TXACR Configuration

#define ETH_DMAA4TXACR_THC                                          (0xFu<<16)
#define ETH_DMAA4TXACR_THC_0                                        (0x1u<<16)
#define ETH_DMAA4TXACR_TEC                                          (0xFu<<8)
#define ETH_DMAA4TXACR_TEC_0                                        (0x1u<<8)
#define ETH_DMAA4TXACR_TDRC                                         (0xFu<<0)
#define ETH_DMAA4TXACR_TDRC_0                                       (0x1u<<0)

// DMAA4RXACR Configuration

#define ETH_DMAA4RXACR_RDC                                          (0xFu<<24)
#define ETH_DMAA4RXACR_RDC_0                                        (0x1u<<24)
#define ETH_DMAA4RXACR_RHC                                          (0xFu<<16)
#define ETH_DMAA4RXACR_RHC_0                                        (0x1u<<16)
#define ETH_DMAA4RXACR_RPC                                          (0xFu<<8)
#define ETH_DMAA4RXACR_RPC_0                                        (0x1u<<8)
#define ETH_DMAA4RXACR_RDWC                                         (0xFu<<0)
#define ETH_DMAA4RXACR_RDWC_0                                       (0x1u<<0)

// DMAA4DACR Configuration

#define ETH_DMAA4DACR_RDRC                                          (0xFu<<8)
#define ETH_DMAA4DACR_RDRC_0                                        (0x1u<<8)
#define ETH_DMAA4DACR_TDWD                                          (0x3u<<4)
#define ETH_DMAA4DACR_TDWD_0                                        (0x1u<<4)
#define ETH_DMAA4DACR_TDWC                                          (0xFu<<0)
#define ETH_DMAA4DACR_TDWC_0                                        (0x1u<<0)

// DMALPIEI Configuration

#define ETH_DMALPIEI_LPIEI                                          (0xFu<<0)
#define ETH_DMALPIEI_LPIEI_0                                        (0x1u<<0)

// DMATBSCTRL0R Configuration

#define ETH_DMATBSCTRL0R_FTOS                                       (0xFFFFFFu<<8)
#define ETH_DMATBSCTRL0R_FTOS_0                                     (0x1u<<8)
#define ETH_DMATBSCTRL0R_FGOS                                       (0x7u<<4)
#define ETH_DMATBSCTRL0R_FGOS_0                                     (0x1u<<4)
#define ETH_DMATBSCTRL0R_FTOV                                       (0x1u<<0)

#define ETH_DMATBSCTRL0R_FTOV_B_0X0                                 (0x0u<<0)
#define ETH_DMATBSCTRL0R_FTOV_B_0X1                                 (0x1u<<0)

// DMATBSCTRL0R_ALTERNATE1 Configuration

#define ETH_DMATBSCTRL0R_ALTERNATE1_FTOS                            (0xFFFFFFu<<8)
#define ETH_DMATBSCTRL0R_ALTERNATE1_FTOS_0                          (0x1u<<8)
#define ETH_DMATBSCTRL0R_ALTERNATE1_FGOS                            (0x7u<<4)
#define ETH_DMATBSCTRL0R_ALTERNATE1_FGOS_0                          (0x1u<<4)
#define ETH_DMATBSCTRL0R_ALTERNATE1_FTOV                            (0x1u<<0)

#define ETH_DMATBSCTRL0R_ALTERNATE1_FTOV_B_0X0                      (0x0u<<0)
#define ETH_DMATBSCTRL0R_ALTERNATE1_FTOV_B_0X1                      (0x1u<<0)

// DMATBSCTRL1R Configuration

#define ETH_DMATBSCTRL1R_FTOS                                       (0xFFFFFFu<<8)
#define ETH_DMATBSCTRL1R_FTOS_0                                     (0x1u<<8)
#define ETH_DMATBSCTRL1R_FGOS                                       (0x7u<<4)
#define ETH_DMATBSCTRL1R_FGOS_0                                     (0x1u<<4)
#define ETH_DMATBSCTRL1R_FTOV                                       (0x1u<<0)

#define ETH_DMATBSCTRL1R_FTOV_B_0X0                                 (0x0u<<0)
#define ETH_DMATBSCTRL1R_FTOV_B_0X1                                 (0x1u<<0)

// DMATBSCTRL2R Configuration

#define ETH_DMATBSCTRL2R_FTOS                                       (0xFFFFFFu<<8)
#define ETH_DMATBSCTRL2R_FTOS_0                                     (0x1u<<8)
#define ETH_DMATBSCTRL2R_FGOS                                       (0x7u<<4)
#define ETH_DMATBSCTRL2R_FGOS_0                                     (0x1u<<4)
#define ETH_DMATBSCTRL2R_FTOV                                       (0x1u<<0)

#define ETH_DMATBSCTRL2R_FTOV_B_0X0                                 (0x0u<<0)
#define ETH_DMATBSCTRL2R_FTOV_B_0X1                                 (0x1u<<0)

// DMATBSCTRL3R Configuration

#define ETH_DMATBSCTRL3R_FTOS                                       (0xFFFFFFu<<8)
#define ETH_DMATBSCTRL3R_FTOS_0                                     (0x1u<<8)
#define ETH_DMATBSCTRL3R_FGOS                                       (0x7u<<4)
#define ETH_DMATBSCTRL3R_FGOS_0                                     (0x1u<<4)
#define ETH_DMATBSCTRL3R_FTOV                                       (0x1u<<0)

#define ETH_DMATBSCTRL3R_FTOV_B_0X0                                 (0x0u<<0)
#define ETH_DMATBSCTRL3R_FTOV_B_0X1                                 (0x1u<<0)

// DMAC0CR Configuration

#define ETH_DMAC0CR_DSL                                             (0x7u<<18)
#define ETH_DMAC0CR_DSL_0                                           (0x1u<<18)
#define ETH_DMAC0CR_PBLX8                                           (0x1u<<16)
#define ETH_DMAC0CR_MSS                                             (0x3FFFu<<0)
#define ETH_DMAC0CR_MSS_0                                           (0x1u<<0)

// DMAC0TXCR Configuration

#define ETH_DMAC0TXCR_TFSEL1                                        (0x1u<<30)
#define ETH_DMAC0TXCR_TFSEL0                                        (0x1u<<29)
#define ETH_DMAC0TXCR_EDSE                                          (0x1u<<28)
#define ETH_DMAC0TXCR_TQOS                                          (0xFu<<24)
#define ETH_DMAC0TXCR_TQOS_0                                        (0x1u<<24)
#define ETH_DMAC0TXCR_TXPBL                                         (0x3Fu<<16)
#define ETH_DMAC0TXCR_TXPBL_0                                       (0x1u<<16)
#define ETH_DMAC0TXCR_IPBL                                          (0x1u<<15)
#define ETH_DMAC0TXCR_TSE                                           (0x1u<<12)
#define ETH_DMAC0TXCR_OSF                                           (0x1u<<4)
#define ETH_DMAC0TXCR_TCW                                           (0x7u<<1)
#define ETH_DMAC0TXCR_TCW_0                                         (0x1u<<1)
#define ETH_DMAC0TXCR_ST                                            (0x1u<<0)

#define ETH_DMAC0TXCR_TFSEL1_B_0X0                                  (0x0u<<30)
#define ETH_DMAC0TXCR_TFSEL1_B_0X1                                  (0x1u<<30)
#define ETH_DMAC0TXCR_TFSEL0_B_0X0                                  (0x0u<<29)
#define ETH_DMAC0TXCR_TFSEL0_B_0X1                                  (0x1u<<29)

// DMAC0RXCR Configuration

#define ETH_DMAC0RXCR_RPF                                           (0x1u<<31)
#define ETH_DMAC0RXCR_RQOS                                          (0xFu<<24)
#define ETH_DMAC0RXCR_RQOS_0                                        (0x1u<<24)
#define ETH_DMAC0RXCR_RXPBL                                         (0x3Fu<<16)
#define ETH_DMAC0RXCR_RXPBL_0                                       (0x1u<<16)
#define ETH_DMAC0RXCR_RBSZ                                          (0x3FFFu<<1)
#define ETH_DMAC0RXCR_RBSZ_0                                        (0x1u<<1)
#define ETH_DMAC0RXCR_SR                                            (0x1u<<0)

// DMAC0TXDLAR Configuration

#define ETH_DMAC0TXDLAR_TDESLA                                      (0xFFFFFFFFu<<0)
#define ETH_DMAC0TXDLAR_TDESLA_0                                    (0x1u<<0)

