Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// DMAC0RXDLAR Configuration

#define ETH_DMAC0RXDLAR_RDESLA                                      (0xFFFFFFFFu<<0)
#define ETH_DMAC0RXDLAR_RDESLA_0                                    (0x1u<<0)

// DMAC0TXDTPR Configuration

#define ETH_DMAC0TXDTPR_TDT                                         (0xFFFFFFFFu<<0)
#define ETH_DMAC0TXDTPR_TDT_0                                       (0x1u<<0)

// DMAC0RXDTPR Configuration

#define ETH_DMAC0RXDTPR_RDT                                         (0xFFFFFFFFu<<0)
#define ETH_DMAC0RXDTPR_RDT_0                                       (0x1u<<0)

// DMAC0TXRLR Configuration

#define ETH_DMAC0TXRLR_TDRL                                         (0x3FFu<<0)
#define ETH_DMAC0TXRLR_TDRL_0                                       (0x1u<<0)

// DMAC0RXRLR Configuration

#define ETH_DMAC0RXRLR_ARBS                                         (0x7Fu<<17)
#define ETH_DMAC0RXRLR_ARBS_0                                       (0x1u<<17)
#define ETH_DMAC0RXRLR_RDRL                                         (0x3FFu<<0)
#define ETH_DMAC0RXRLR_RDRL_0                                       (0x1u<<0)

// DMAC0IER Configuration

#define ETH_DMAC0IER_NIE                                            (0x1u<<15)
#define ETH_DMAC0IER_AIE                                            (0x1u<<14)
#define ETH_DMAC0IER_CDEE                                           (0x1u<<13)
#define ETH_DMAC0IER_FBEE                                           (0x1u<<12)
#define ETH_DMAC0IER_ERIE                                           (0x1u<<11)
#define ETH_DMAC0IER_ETIE                                           (0x1u<<10)
#define ETH_DMAC0IER_RWTE                                           (0x1u<<9)
#define ETH_DMAC0IER_RSE                                            (0x1u<<8)
#define ETH_DMAC0IER_RBUE                                           (0x1u<<7)
#define ETH_DMAC0IER_RIE                                            (0x1u<<6)
#define ETH_DMAC0IER_TBUE                                           (0x1u<<2)
#define ETH_DMAC0IER_TXSE                                           (0x1u<<1)
#define ETH_DMAC0IER_TIE                                            (0x1u<<0)

// DMAC0RXIWTR Configuration

#define ETH_DMAC0RXIWTR_RWTU                                        (0x3u<<16)
#define ETH_DMAC0RXIWTR_RWTU_0                                      (0x1u<<16)
#define ETH_DMAC0RXIWTR_RWT                                         (0xFFu<<0)
#define ETH_DMAC0RXIWTR_RWT_0                                       (0x1u<<0)

#define ETH_DMAC0RXIWTR_RWTU_B_0X0                                  (0x0u<<16)
#define ETH_DMAC0RXIWTR_RWTU_B_0X1                                  (0x1u<<16)
#define ETH_DMAC0RXIWTR_RWTU_B_0X2                                  (0x2u<<16)
#define ETH_DMAC0RXIWTR_RWTU_B_0X3                                  (0x3u<<16)

// DMAC0SFCSR Configuration

#define ETH_DMAC0SFCSR_RSN                                          (0xFu<<16)
#define ETH_DMAC0SFCSR_RSN_0                                        (0x1u<<16)
#define ETH_DMAC0SFCSR_SIV                                          (0xFFFu<<4)
#define ETH_DMAC0SFCSR_SIV_0                                        (0x1u<<4)
#define ETH_DMAC0SFCSR_ASC                                          (0x1u<<1)
#define ETH_DMAC0SFCSR_ESC                                          (0x1u<<0)

// DMAC0CATXDR Configuration

#define ETH_DMAC0CATXDR_CURTDESAPTR                                 (0xFFFFFFFFu<<0)
#define ETH_DMAC0CATXDR_CURTDESAPTR_0                               (0x1u<<0)

// DMAC0CARXDR Configuration

#define ETH_DMAC0CARXDR_CURRDESAPTR                                 (0xFFFFFFFFu<<0)
#define ETH_DMAC0CARXDR_CURRDESAPTR_0                               (0x1u<<0)

// DMAC0CATXBR Configuration

#define ETH_DMAC0CATXBR_CURTBUFAPTR                                 (0xFFFFFFFFu<<0)
#define ETH_DMAC0CATXBR_CURTBUFAPTR_0                               (0x1u<<0)

// DMAC0CARXBR Configuration

#define ETH_DMAC0CARXBR_CURRBUFAPTR                                 (0xFFFFFFFFu<<0)
#define ETH_DMAC0CARXBR_CURRBUFAPTR_0                               (0x1u<<0)

// DMAC0SR Configuration

#define ETH_DMAC0SR_REB                                             (0x7u<<19)
#define ETH_DMAC0SR_REB_0                                           (0x1u<<19)
#define ETH_DMAC0SR_TEB                                             (0x7u<<16)
#define ETH_DMAC0SR_TEB_0                                           (0x1u<<16)
#define ETH_DMAC0SR_NIS                                             (0x1u<<15)
#define ETH_DMAC0SR_AIS                                             (0x1u<<14)
#define ETH_DMAC0SR_CDE                                             (0x1u<<13)
#define ETH_DMAC0SR_FBE                                             (0x1u<<12)
#define ETH_DMAC0SR_ERI                                             (0x1u<<11)
#define ETH_DMAC0SR_ETI                                             (0x1u<<10)
#define ETH_DMAC0SR_RWT                                             (0x1u<<9)
#define ETH_DMAC0SR_RPS                                             (0x1u<<8)
#define ETH_DMAC0SR_RBU                                             (0x1u<<7)
#define ETH_DMAC0SR_RI                                              (0x1u<<6)
#define ETH_DMAC0SR_TBU                                             (0x1u<<2)
#define ETH_DMAC0SR_TPS                                             (0x1u<<1)
#define ETH_DMAC0SR_TI                                              (0x1u<<0)

// DMAC0MFCR Configuration

#define ETH_DMAC0MFCR_MFCO                                          (0x1u<<15)
#define ETH_DMAC0MFCR_MFC                                           (0x7FFu<<0)
#define ETH_DMAC0MFCR_MFC_0                                         (0x1u<<0)

// DMAC1CR Configuration

#define ETH_DMAC1CR_DSL                                             (0x7u<<18)
#define ETH_DMAC1CR_DSL_0                                           (0x1u<<18)
#define ETH_DMAC1CR_PBLX8                                           (0x1u<<16)
#define ETH_DMAC1CR_MSS                                             (0x3FFFu<<0)
#define ETH_DMAC1CR_MSS_0                                           (0x1u<<0)

// DMAC1TXCR Configuration

