Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
// DMAC2CR Configuration

#define ETH_DMAC2CR_DSL                                             (0x7u<<18)
#define ETH_DMAC2CR_DSL_0                                           (0x1u<<18)
#define ETH_DMAC2CR_PBLX8                                           (0x1u<<16)
#define ETH_DMAC2CR_MSS                                             (0x3FFFu<<0)
#define ETH_DMAC2CR_MSS_0                                           (0x1u<<0)

// DMAC2TXCR Configuration

#define ETH_DMAC2TXCR_TFSEL1                                        (0x1u<<30)
#define ETH_DMAC2TXCR_TFSEL0                                        (0x1u<<29)
#define ETH_DMAC2TXCR_EDSE                                          (0x1u<<28)
#define ETH_DMAC2TXCR_TQOS                                          (0xFu<<24)
#define ETH_DMAC2TXCR_TQOS_0                                        (0x1u<<24)
#define ETH_DMAC2TXCR_TXPBL                                         (0x3Fu<<16)
#define ETH_DMAC2TXCR_TXPBL_0                                       (0x1u<<16)
#define ETH_DMAC2TXCR_IPBL                                          (0x1u<<15)
#define ETH_DMAC2TXCR_TSE                                           (0x1u<<12)
#define ETH_DMAC2TXCR_OSF                                           (0x1u<<4)
#define ETH_DMAC2TXCR_TCW                                           (0x7u<<1)
#define ETH_DMAC2TXCR_TCW_0                                         (0x1u<<1)
#define ETH_DMAC2TXCR_ST                                            (0x1u<<0)

#define ETH_DMAC2TXCR_TFSEL1_B_0X0                                  (0x0u<<30)
#define ETH_DMAC2TXCR_TFSEL1_B_0X1                                  (0x1u<<30)
#define ETH_DMAC2TXCR_TFSEL0_B_0X0                                  (0x0u<<29)
#define ETH_DMAC2TXCR_TFSEL0_B_0X1                                  (0x1u<<29)

// DMAC2TXDLAR Configuration

#define ETH_DMAC2TXDLAR_TDESLA                                      (0xFFFFFFFFu<<0)
#define ETH_DMAC2TXDLAR_TDESLA_0                                    (0x1u<<0)

// DMAC2TXDTPR Configuration

#define ETH_DMAC2TXDTPR_TDT                                         (0xFFFFFFFFu<<0)
#define ETH_DMAC2TXDTPR_TDT_0                                       (0x1u<<0)

// DMAC2TXRLR Configuration

#define ETH_DMAC2TXRLR_TDRL                                         (0x3FFu<<0)
#define ETH_DMAC2TXRLR_TDRL_0                                       (0x1u<<0)

// DMAC2IER Configuration

#define ETH_DMAC2IER_NIE                                            (0x1u<<15)
#define ETH_DMAC2IER_AIE                                            (0x1u<<14)
#define ETH_DMAC2IER_CDEE                                           (0x1u<<13)
#define ETH_DMAC2IER_FBEE                                           (0x1u<<12)
#define ETH_DMAC2IER_ERIE                                           (0x1u<<11)
#define ETH_DMAC2IER_ETIE                                           (0x1u<<10)
#define ETH_DMAC2IER_RWTE                                           (0x1u<<9)
#define ETH_DMAC2IER_RSE                                            (0x1u<<8)
#define ETH_DMAC2IER_RBUE                                           (0x1u<<7)
#define ETH_DMAC2IER_RIE                                            (0x1u<<6)
#define ETH_DMAC2IER_TBUE                                           (0x1u<<2)
#define ETH_DMAC2IER_TXSE                                           (0x1u<<1)
#define ETH_DMAC2IER_TIE                                            (0x1u<<0)

// DMAC2SFCSR Configuration

#define ETH_DMAC2SFCSR_RSN                                          (0xFu<<16)
#define ETH_DMAC2SFCSR_RSN_0                                        (0x1u<<16)
#define ETH_DMAC2SFCSR_SIV                                          (0xFFFu<<4)
#define ETH_DMAC2SFCSR_SIV_0                                        (0x1u<<4)
#define ETH_DMAC2SFCSR_ASC                                          (0x1u<<1)
#define ETH_DMAC2SFCSR_ESC                                          (0x1u<<0)

// DMAC2CATXDR Configuration

#define ETH_DMAC2CATXDR_CURTDESAPTR                                 (0xFFFFFFFFu<<0)
#define ETH_DMAC2CATXDR_CURTDESAPTR_0                               (0x1u<<0)

// DMAC2CATXBR Configuration

#define ETH_DMAC2CATXBR_CURTBUFAPTR                                 (0xFFFFFFFFu<<0)
#define ETH_DMAC2CATXBR_CURTBUFAPTR_0                               (0x1u<<0)

// DMAC2SR Configuration

#define ETH_DMAC2SR_REB                                             (0x7u<<19)
#define ETH_DMAC2SR_REB_0                                           (0x1u<<19)
#define ETH_DMAC2SR_TEB                                             (0x7u<<16)
#define ETH_DMAC2SR_TEB_0                                           (0x1u<<16)
#define ETH_DMAC2SR_NIS                                             (0x1u<<15)
#define ETH_DMAC2SR_AIS                                             (0x1u<<14)
#define ETH_DMAC2SR_CDE                                             (0x1u<<13)
#define ETH_DMAC2SR_FBE                                             (0x1u<<12)
#define ETH_DMAC2SR_ERI                                             (0x1u<<11)
#define ETH_DMAC2SR_ETI                                             (0x1u<<10)
#define ETH_DMAC2SR_RWT                                             (0x1u<<9)
#define ETH_DMAC2SR_RPS                                             (0x1u<<8)
#define ETH_DMAC2SR_RBU                                             (0x1u<<7)
#define ETH_DMAC2SR_RI                                              (0x1u<<6)
#define ETH_DMAC2SR_TBU                                             (0x1u<<2)
#define ETH_DMAC2SR_TPS                                             (0x1u<<1)
#define ETH_DMAC2SR_TI                                              (0x1u<<0)

// DMAC3CR Configuration

#define ETH_DMAC3CR_DSL                                             (0x7u<<18)
#define ETH_DMAC3CR_DSL_0                                           (0x1u<<18)
#define ETH_DMAC3CR_PBLX8                                           (0x1u<<16)
#define ETH_DMAC3CR_MSS                                             (0x3FFFu<<0)
#define ETH_DMAC3CR_MSS_0                                           (0x1u<<0)

// DMAC3TXCR Configuration

#define ETH_DMAC3TXCR_TFSEL1                                        (0x1u<<30)
#define ETH_DMAC3TXCR_TFSEL0                                        (0x1u<<29)
#define ETH_DMAC3TXCR_EDSE                                          (0x1u<<28)
#define ETH_DMAC3TXCR_TQOS                                          (0xFu<<24)
#define ETH_DMAC3TXCR_TQOS_0                                        (0x1u<<24)
#define ETH_DMAC3TXCR_TXPBL                                         (0x3Fu<<16)
#define ETH_DMAC3TXCR_TXPBL_0                                       (0x1u<<16)
#define ETH_DMAC3TXCR_IPBL                                          (0x1u<<15)
#define ETH_DMAC3TXCR_TSE                                           (0x1u<<12)
#define ETH_DMAC3TXCR_OSF                                           (0x1u<<4)
#define ETH_DMAC3TXCR_TCW                                           (0x7u<<1)
#define ETH_DMAC3TXCR_TCW_0                                         (0x1u<<1)
#define ETH_DMAC3TXCR_ST                                            (0x1u<<0)

#define ETH_DMAC3TXCR_TFSEL1_B_0X0                                  (0x0u<<30)
#define ETH_DMAC3TXCR_TFSEL1_B_0X1                                  (0x1u<<30)
#define ETH_DMAC3TXCR_TFSEL0_B_0X0                                  (0x0u<<29)
#define ETH_DMAC3TXCR_TFSEL0_B_0X1                                  (0x1u<<29)

// DMAC3TXDLAR Configuration

#define ETH_DMAC3TXDLAR_TDESLA                                      (0xFFFFFFFFu<<0)
#define ETH_DMAC3TXDLAR_TDESLA_0                                    (0x1u<<0)

// DMAC3TXDTPR Configuration

#define ETH_DMAC3TXDTPR_TDT                                         (0xFFFFFFFFu<<0)
#define ETH_DMAC3TXDTPR_TDT_0                                       (0x1u<<0)

// DMAC3TXRLR Configuration

#define ETH_DMAC3TXRLR_TDRL                                         (0x3FFu<<0)
#define ETH_DMAC3TXRLR_TDRL_0                                       (0x1u<<0)

// DMAC3IER Configuration

#define ETH_DMAC3IER_NIE                                            (0x1u<<15)
#define ETH_DMAC3IER_AIE                                            (0x1u<<14)
#define ETH_DMAC3IER_CDEE                                           (0x1u<<13)
#define ETH_DMAC3IER_FBEE                                           (0x1u<<12)
#define ETH_DMAC3IER_ERIE                                           (0x1u<<11)
#define ETH_DMAC3IER_ETIE                                           (0x1u<<10)
#define ETH_DMAC3IER_RWTE                                           (0x1u<<9)
#define ETH_DMAC3IER_RSE                                            (0x1u<<8)
#define ETH_DMAC3IER_RBUE                                           (0x1u<<7)
#define ETH_DMAC3IER_RIE                                            (0x1u<<6)
#define ETH_DMAC3IER_TBUE                                           (0x1u<<2)
#define ETH_DMAC3IER_TXSE                                           (0x1u<<1)
#define ETH_DMAC3IER_TIE                                            (0x1u<<0)

// DMAC3SFCSR Configuration

#define ETH_DMAC3SFCSR_RSN                                          (0xFu<<16)
#define ETH_DMAC3SFCSR_RSN_0                                        (0x1u<<16)
#define ETH_DMAC3SFCSR_SIV                                          (0xFFFu<<4)
#define ETH_DMAC3SFCSR_SIV_0                                        (0x1u<<4)
#define ETH_DMAC3SFCSR_ASC                                          (0x1u<<1)
#define ETH_DMAC3SFCSR_ESC                                          (0x1u<<0)

// DMAC3CATXDR Configuration

#define ETH_DMAC3CATXDR_CURTDESAPTR                                 (0xFFFFFFFFu<<0)
#define ETH_DMAC3CATXDR_CURTDESAPTR_0                               (0x1u<<0)

// DMAC3CATXBR Configuration

