Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_eth.h
#define ETH_DMAC3CATXBR_CURTBUFAPTR                                 (0xFFFFFFFFu<<0)
#define ETH_DMAC3CATXBR_CURTBUFAPTR_0                               (0x1u<<0)

// DMAC3SR Configuration

#define ETH_DMAC3SR_REB                                             (0x7u<<19)
#define ETH_DMAC3SR_REB_0                                           (0x1u<<19)
#define ETH_DMAC3SR_TEB                                             (0x7u<<16)
#define ETH_DMAC3SR_TEB_0                                           (0x1u<<16)
#define ETH_DMAC3SR_NIS                                             (0x1u<<15)
#define ETH_DMAC3SR_AIS                                             (0x1u<<14)
#define ETH_DMAC3SR_CDE                                             (0x1u<<13)
#define ETH_DMAC3SR_FBE                                             (0x1u<<12)
#define ETH_DMAC3SR_ERI                                             (0x1u<<11)
#define ETH_DMAC3SR_ETI                                             (0x1u<<10)
#define ETH_DMAC3SR_RWT                                             (0x1u<<9)
#define ETH_DMAC3SR_RPS                                             (0x1u<<8)
#define ETH_DMAC3SR_RBU                                             (0x1u<<7)
#define ETH_DMAC3SR_RI                                              (0x1u<<6)
#define ETH_DMAC3SR_TBU                                             (0x1u<<2)
#define ETH_DMAC3SR_TPS                                             (0x1u<<1)
#define ETH_DMAC3SR_TI                                              (0x1u<<0)
